MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP85R:6;
      uint16_t :2;
      uint16_t RP87R:6;
    };
    struct {
      uint16_t RP85R0:1;
      uint16_t RP85R1:1;
      uint16_t RP85R2:1;
      uint16_t RP85R3:1;
      uint16_t RP85R4:1;
      uint16_t RP85R5:1;
      uint16_t :2;
      uint16_t RP87R0:1;
      uint16_t RP87R1:1;
      uint16_t RP87R2:1;
      uint16_t RP87R3:1;
      uint16_t RP87R4:1;
      uint16_t RP87R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP96R:6;
      uint16_t :2;
      uint16_t RP97R:6;
    };
    struct {
      uint16_t RP96R0:1;
      uint16_t RP96R1:1;
      uint16_t RP96R2:1;
      uint16_t RP96R3:1;
      uint16_t RP96R4:1;
      uint16_t RP96R5:1;
      uint16_t :2;
      uint16_t RP97R0:1;
      uint16_t RP97R1:1;
      uint16_t RP97R2:1;
      uint16_t RP97R3:1;
      uint16_t RP97R4:1;
      uint16_t RP97R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      uint16_t RP98R:6;
      uint16_t :2;
      uint16_t RP99R:6;
    };
    struct {
      uint16_t RP98R0:1;
      uint16_t RP98R1:1;
      uint16_t RP98R2:1;
      uint16_t RP98R3:1;
      uint16_t RP98R4:1;
      uint16_t RP98R5:1;
      uint16_t :2;
      uint16_t RP99R0:1;
      uint16_t RP99R1:1;
      uint16_t RP99R2:1;
      uint16_t RP99R3:1;
      uint16_t RP99R4:1;
      uint16_t RP99R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      uint16_t RP100R:6;
      uint16_t :2;
      uint16_t RP101R:6;
    };
    struct {
      uint16_t RP100R0:1;
      uint16_t RP100R1:1;
      uint16_t RP100R2:1;
      uint16_t RP100R3:1;
      uint16_t RP100R4:1;
      uint16_t RP100R5:1;
      uint16_t :2;
      uint16_t RP101R0:1;
      uint16_t RP101R1:1;
      uint16_t RP101R2:1;
      uint16_t RP101R3:1;
      uint16_t RP101R4:1;
      uint16_t RP101R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR11BITS {
  union {
    struct {
      uint16_t RP104R:6;
      uint16_t :2;
      uint16_t RP108R:6;
    };
    struct {
      uint16_t RP104R0:1;
      uint16_t RP104R1:1;
      uint16_t RP104R2:1;
      uint16_t RP104R3:1;
      uint16_t RP104R4:1;
      uint16_t RP104R5:1;
      uint16_t :2;
      uint16_t RP108R0:1;
      uint16_t RP108R1:1;
      uint16_t RP108R2:1;
      uint16_t RP108R3:1;
      uint16_t RP108R4:1;
      uint16_t RP108R5:1;
    };
  };
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      uint16_t RP109R:6;
      uint16_t :2;
      uint16_t RP112R:6;
    };
    struct {
      uint16_t RP109R0:1;
      uint16_t RP109R1:1;
      uint16_t RP109R2:1;
      uint16_t RP109R3:1;
      uint16_t RP109R4:1;
      uint16_t RP109R5:1;
      uint16_t :2;
      uint16_t RP112R0:1;
      uint16_t RP112R1:1;
      uint16_t RP112R2:1;
      uint16_t RP112R3:1;
      uint16_t RP112R4:1;
      uint16_t RP112R5:1;
    };
  };
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      uint16_t RP113R:6;
      uint16_t :2;
      uint16_t RP118R:6;
    };
    struct {
      uint16_t RP113R0:1;
      uint16_t RP113R1:1;
      uint16_t RP113R2:1;
      uint16_t RP113R3:1;
      uint16_t RP113R4:1;
      uint16_t RP113R5:1;
      uint16_t :2;
      uint16_t RP118R0:1;
      uint16_t RP118R1:1;
      uint16_t RP118R2:1;
      uint16_t RP118R3:1;
      uint16_t RP118R4:1;
      uint16_t RP118R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      uint16_t RP120R:6;
      uint16_t :2;
      uint16_t RP125R:6;
    };
    struct {
      uint16_t RP120R0:1;
      uint16_t RP120R1:1;
      uint16_t RP120R2:1;
      uint16_t RP120R3:1;
      uint16_t RP120R4:1;
      uint16_t RP120R5:1;
      uint16_t :2;
      uint16_t RP125R0:1;
      uint16_t RP125R1:1;
      uint16_t RP125R2:1;
      uint16_t RP125R3:1;
      uint16_t RP125R4:1;
      uint16_t RP125R5:1;
    };
  };
} RPOR14BITS;
extern volatile RPOR14BITS RPOR14bits __attribute__((__sfr__));

#define RPOR15 RPOR15
extern volatile uint16_t RPOR15 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR15BITS {
  union {
    struct {
      uint16_t RP126R:6;
      uint16_t :2;
      uint16_t RP127R:6;
    };
    struct {
      uint16_t RP126R0:1;
      uint16_t RP126R1:1;
      uint16_t RP126R2:1;
      uint16_t RP126R3:1;
      uint16_t RP126R4:1;
      uint16_t RP126R5:1;
      uint16_t :2;
      uint16_t RP127R0:1;
      uint16_t RP127R1:1;
      uint16_t RP127R2:1;
      uint16_t RP127R3:1;
      uint16_t RP127R4:1;
      uint16_t RP127R5:1;
    };
  };
} RPOR15BITS;
extern volatile RPOR15BITS RPOR15bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t INT1R:7;
    };
    struct {
      uint16_t :8;
      uint16_t INT1R0:1;
      uint16_t INT1R1:1;
      uint16_t INT1R2:1;
      uint16_t INT1R3:1;
      uint16_t INT1R4:1;
      uint16_t INT1R5:1;
      uint16_t INT1R6:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      uint16_t INT2R:7;
      uint16_t :1;
      uint16_t INT3R:7;
    };
    struct {
      uint16_t INT2R0:1;
      uint16_t INT2R1:1;
      uint16_t INT2R2:1;
      uint16_t INT2R3:1;
      uint16_t INT2R4:1;
      uint16_t INT2R5:1;
      uint16_t INT2R6:1;
      uint16_t :1;
      uint16_t INT3R0:1;
      uint16_t INT3R1:1;
      uint16_t INT3R2:1;
      uint16_t INT3R3:1;
      uint16_t INT3R4:1;
      uint16_t INT3R5:1;
      uint16_t INT3R6:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      uint16_t INT4R:7;
      uint16_t :1;
      uint16_t RSVR:7;
    };
    struct {
      uint16_t INT4R0:1;
      uint16_t INT4R1:1;
      uint16_t INT4R2:1;
      uint16_t INT4R3:1;
      uint16_t INT4R4:1;
      uint16_t INT4R5:1;
      uint16_t INT4R6:1;
      uint16_t :1;
      uint16_t RSVR0:1;
      uint16_t RSVR1:1;
      uint16_t RSVR2:1;
      uint16_t RSVR3:1;
      uint16_t RSVR4:1;
      uint16_t RSVR5:1;
      uint16_t RSVR6:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      uint16_t T2CKR:7;
      uint16_t :1;
      uint16_t T3CKR:7;
    };
    struct {
      uint16_t T2CKR0:1;
      uint16_t T2CKR1:1;
      uint16_t T2CKR2:1;
      uint16_t T2CKR3:1;
      uint16_t T2CKR4:1;
      uint16_t T2CKR5:1;
      uint16_t T2CKR6:1;
      uint16_t :1;
      uint16_t T3CKR0:1;
      uint16_t T3CKR1:1;
      uint16_t T3CKR2:1;
      uint16_t T3CKR3:1;
      uint16_t T3CKR4:1;
      uint16_t T3CKR5:1;
      uint16_t T3CKR6:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR4 RPINR4
extern volatile uint16_t RPINR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR4BITS {
  union {
    struct {
      uint16_t T4CKR:7;
      uint16_t :1;
      uint16_t T5CKR:7;
    };
    struct {
      uint16_t T4CKR0:1;
      uint16_t T4CKR1:1;
      uint16_t T4CKR2:1;
      uint16_t T4CKR3:1;
      uint16_t T4CKR4:1;
      uint16_t T4CKR5:1;
      uint16_t T4CKR6:1;
      uint16_t :1;
      uint16_t T5CKR0:1;
      uint16_t T5CKR1:1;
      uint16_t T5CKR2:1;
      uint16_t T5CKR3:1;
      uint16_t T5CKR4:1;
      uint16_t T5CKR5:1;
      uint16_t T5CKR6:1;
    };
  };
} RPINR4BITS;
extern volatile RPINR4BITS RPINR4bits __attribute__((__sfr__));

#define RPINR5 RPINR5
extern volatile uint16_t RPINR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR5BITS {
  union {
    struct {
      uint16_t T6CKR:7;
      uint16_t :1;
      uint16_t T7CKR:7;
    };
    struct {
      uint16_t T6CKR0:1;
      uint16_t T6CKR1:1;
      uint16_t T6CKR2:1;
      uint16_t T6CKR3:1;
      uint16_t T6CKR4:1;
      uint16_t T6CKR5:1;
      uint16_t T6CKR6:1;
      uint16_t :1;
      uint16_t T7CKR0:1;
      uint16_t T7CKR1:1;
      uint16_t T7CKR2:1;
      uint16_t T7CKR3:1;
      uint16_t T7CKR4:1;
      uint16_t T7CKR5:1;
      uint16_t T7CKR6:1;
    };
  };
} RPINR5BITS;
extern volatile RPINR5BITS RPINR5bits __attribute__((__sfr__));

