MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
extern volatile DMA10STBHBITS DMA10STBHbits __attribute__((__sfr__));

#define DMA10PAD DMA10PAD
extern volatile uint16_t DMA10PAD __attribute__((__sfr__));
#define DMA10CNT DMA10CNT
extern volatile uint16_t DMA10CNT __attribute__((__sfr__));
typedef struct tagDMA10CNTBITS {
  uint16_t CNT:14;
} DMA10CNTBITS;
extern volatile DMA10CNTBITS DMA10CNTbits __attribute__((__sfr__));

#define DMA11CON DMA11CON
extern volatile uint16_t DMA11CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA11CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA11CONBITS;
extern volatile DMA11CONBITS DMA11CONbits __attribute__((__sfr__));

#define DMA11REQ DMA11REQ
extern volatile uint16_t DMA11REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA11REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA11REQBITS;
extern volatile DMA11REQBITS DMA11REQbits __attribute__((__sfr__));

#define DMA11STAL DMA11STAL
extern volatile uint16_t DMA11STAL __attribute__((__sfr__));
#define DMA11STAH DMA11STAH
extern volatile uint16_t DMA11STAH __attribute__((__sfr__));
typedef struct tagDMA11STAHBITS {
  uint16_t STA:8;
} DMA11STAHBITS;
extern volatile DMA11STAHBITS DMA11STAHbits __attribute__((__sfr__));

#define DMA11STBL DMA11STBL
extern volatile uint16_t DMA11STBL __attribute__((__sfr__));
#define DMA11STBH DMA11STBH
extern volatile uint16_t DMA11STBH __attribute__((__sfr__));
typedef struct tagDMA11STBHBITS {
  uint16_t STB:8;
} DMA11STBHBITS;
extern volatile DMA11STBHBITS DMA11STBHbits __attribute__((__sfr__));

#define DMA11PAD DMA11PAD
extern volatile uint16_t DMA11PAD __attribute__((__sfr__));
#define DMA11CNT DMA11CNT
extern volatile uint16_t DMA11CNT __attribute__((__sfr__));
typedef struct tagDMA11CNTBITS {
  uint16_t CNT:14;
} DMA11CNTBITS;
extern volatile DMA11CNTBITS DMA11CNTbits __attribute__((__sfr__));

#define DMA12CON DMA12CON
extern volatile uint16_t DMA12CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA12CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA12CONBITS;
extern volatile DMA12CONBITS DMA12CONbits __attribute__((__sfr__));

#define DMA12REQ DMA12REQ
extern volatile uint16_t DMA12REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA12REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA12REQBITS;
extern volatile DMA12REQBITS DMA12REQbits __attribute__((__sfr__));

#define DMA12STAL DMA12STAL
extern volatile uint16_t DMA12STAL __attribute__((__sfr__));
#define DMA12STAH DMA12STAH
extern volatile uint16_t DMA12STAH __attribute__((__sfr__));
typedef struct tagDMA12STAHBITS {
  uint16_t STA:8;
} DMA12STAHBITS;
extern volatile DMA12STAHBITS DMA12STAHbits __attribute__((__sfr__));

#define DMA12STBL DMA12STBL
extern volatile uint16_t DMA12STBL __attribute__((__sfr__));
#define DMA12STBH DMA12STBH
extern volatile uint16_t DMA12STBH __attribute__((__sfr__));
typedef struct tagDMA12STBHBITS {
  uint16_t STB:8;
} DMA12STBHBITS;
extern volatile DMA12STBHBITS DMA12STBHbits __attribute__((__sfr__));

#define DMA12PAD DMA12PAD
extern volatile uint16_t DMA12PAD __attribute__((__sfr__));
#define DMA12CNT DMA12CNT
extern volatile uint16_t DMA12CNT __attribute__((__sfr__));
typedef struct tagDMA12CNTBITS {
  uint16_t CNT:14;
} DMA12CNTBITS;
extern volatile DMA12CNTBITS DMA12CNTbits __attribute__((__sfr__));

#define DMA13CON DMA13CON
extern volatile uint16_t DMA13CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA13CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA13CONBITS;
extern volatile DMA13CONBITS DMA13CONbits __attribute__((__sfr__));

#define DMA13REQ DMA13REQ
extern volatile uint16_t DMA13REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA13REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA13REQBITS;
extern volatile DMA13REQBITS DMA13REQbits __attribute__((__sfr__));

#define DMA13STAL DMA13STAL
extern volatile uint16_t DMA13STAL __attribute__((__sfr__));
#define DMA13STAH DMA13STAH
extern volatile uint16_t DMA13STAH __attribute__((__sfr__));
typedef struct tagDMA13STAHBITS {
  uint16_t STA:8;
} DMA13STAHBITS;
extern volatile DMA13STAHBITS DMA13STAHbits __attribute__((__sfr__));

#define DMA13STBL DMA13STBL
extern volatile uint16_t DMA13STBL __attribute__((__sfr__));
#define DMA13STBH DMA13STBH
extern volatile uint16_t DMA13STBH __attribute__((__sfr__));
typedef struct tagDMA13STBHBITS {
  uint16_t STB:8;
} DMA13STBHBITS;
extern volatile DMA13STBHBITS DMA13STBHbits __attribute__((__sfr__));

#define DMA13PAD DMA13PAD
extern volatile uint16_t DMA13PAD __attribute__((__sfr__));
#define DMA13CNT DMA13CNT
extern volatile uint16_t DMA13CNT __attribute__((__sfr__));
typedef struct tagDMA13CNTBITS {
  uint16_t CNT:14;
} DMA13CNTBITS;
