MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define CNPUG CNPUG
extern volatile uint16_t CNPUG __attribute__((__sfr__));
typedef struct tagCNPUGBITS {
  uint16_t CNPUG0:1;
  uint16_t CNPUG1:1;
  uint16_t :4;
  uint16_t CNPUG6:1;
  uint16_t CNPUG7:1;
  uint16_t CNPUG8:1;
  uint16_t CNPUG9:1;
  uint16_t :2;
  uint16_t CNPUG12:1;
  uint16_t CNPUG13:1;
  uint16_t CNPUG14:1;
  uint16_t CNPUG15:1;
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile uint16_t CNPDG __attribute__((__sfr__));
typedef struct tagCNPDGBITS {
  uint16_t CNPDG0:1;
  uint16_t CNPDG1:1;
  uint16_t :4;
  uint16_t CNPDG6:1;
  uint16_t CNPDG7:1;
  uint16_t CNPDG8:1;
  uint16_t CNPDG9:1;
  uint16_t :2;
  uint16_t CNPDG12:1;
  uint16_t CNPDG13:1;
  uint16_t CNPDG14:1;
  uint16_t CNPDG15:1;
} CNPDGBITS;
extern volatile CNPDGBITS CNPDGbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
typedef struct tagANSELGBITS {
  uint16_t :6;
  uint16_t ANSG6:1;
  uint16_t ANSG7:1;
  uint16_t ANSG8:1;
  uint16_t ANSG9:1;
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define TRISH TRISH
extern volatile uint16_t TRISH __attribute__((__sfr__));
typedef struct tagTRISHBITS {
  uint16_t TRISH0:1;
  uint16_t TRISH1:1;
  uint16_t TRISH2:1;
  uint16_t TRISH3:1;
  uint16_t TRISH4:1;
  uint16_t TRISH5:1;
  uint16_t TRISH6:1;
  uint16_t TRISH7:1;
  uint16_t TRISH8:1;
  uint16_t TRISH9:1;
  uint16_t TRISH10:1;
  uint16_t TRISH11:1;
  uint16_t TRISH12:1;
  uint16_t TRISH13:1;
  uint16_t TRISH14:1;
  uint16_t TRISH15:1;
} TRISHBITS;
extern volatile TRISHBITS TRISHbits __attribute__((__sfr__));

#define PORTH PORTH
extern volatile uint16_t PORTH __attribute__((__sfr__));
typedef struct tagPORTHBITS {
  uint16_t RH0:1;
  uint16_t RH1:1;
  uint16_t RH2:1;
  uint16_t RH3:1;
  uint16_t RH4:1;
  uint16_t RH5:1;
  uint16_t RH6:1;
  uint16_t RH7:1;
  uint16_t RH8:1;
  uint16_t RH9:1;
  uint16_t RH10:1;
  uint16_t RH11:1;
  uint16_t RH12:1;
  uint16_t RH13:1;
  uint16_t RH14:1;
  uint16_t RH15:1;
} PORTHBITS;
extern volatile PORTHBITS PORTHbits __attribute__((__sfr__));

#define LATH LATH
extern volatile uint16_t LATH __attribute__((__sfr__));
typedef struct tagLATHBITS {
  uint16_t LATH0:1;
  uint16_t LATH1:1;
  uint16_t LATH2:1;
  uint16_t LATH3:1;
  uint16_t LATH4:1;
  uint16_t LATH5:1;
  uint16_t LATH6:1;
  uint16_t LATH7:1;
  uint16_t LATH8:1;
  uint16_t LATH9:1;
  uint16_t LATH10:1;
  uint16_t LATH11:1;
  uint16_t LATH12:1;
  uint16_t LATH13:1;
  uint16_t LATH14:1;
  uint16_t LATH15:1;
} LATHBITS;
extern volatile LATHBITS LATHbits __attribute__((__sfr__));

#define ODCH ODCH
extern volatile uint16_t ODCH __attribute__((__sfr__));
typedef struct tagODCHBITS {
  uint16_t ODCH0:1;
  uint16_t ODCH1:1;
  uint16_t ODCH2:1;
  uint16_t ODCH3:1;
  uint16_t ODCH4:1;
  uint16_t ODCH5:1;
  uint16_t ODCH6:1;
  uint16_t ODCH7:1;
  uint16_t ODCH8:1;
  uint16_t ODCH9:1;
  uint16_t ODCH10:1;
  uint16_t ODCH11:1;
  uint16_t ODCH12:1;
  uint16_t ODCH13:1;
  uint16_t ODCH14:1;
  uint16_t ODCH15:1;
} ODCHBITS;
extern volatile ODCHBITS ODCHbits __attribute__((__sfr__));

#define CNENH CNENH
extern volatile uint16_t CNENH __attribute__((__sfr__));
typedef struct tagCNENHBITS {
  uint16_t CNIEH0:1;
  uint16_t CNIEH1:1;
  uint16_t CNIEH2:1;
  uint16_t CNIEH3:1;
  uint16_t CNIEH4:1;
  uint16_t CNIEH5:1;
  uint16_t CNIEH6:1;
  uint16_t CNIEH7:1;
  uint16_t CNIEH8:1;
  uint16_t CNIEH9:1;
  uint16_t CNIEH10:1;
  uint16_t CNIEH11:1;
  uint16_t CNIEH12:1;
  uint16_t CNIEH13:1;
  uint16_t CNIEH14:1;
  uint16_t CNIEH15:1;
} CNENHBITS;
extern volatile CNENHBITS CNENHbits __attribute__((__sfr__));

#define CNPUH CNPUH
extern volatile uint16_t CNPUH __attribute__((__sfr__));
typedef struct tagCNPUHBITS {
  uint16_t CNPUH0:1;
  uint16_t CNPUH1:1;
  uint16_t CNPUH2:1;
  uint16_t CNPUH3:1;
  uint16_t CNPUH4:1;
  uint16_t CNPUH5:1;
  uint16_t CNPUH6:1;
  uint16_t CNPUH7:1;
  uint16_t CNPUH8:1;
  uint16_t CNPUH9:1;
  uint16_t CNPUH10:1;
  uint16_t CNPUH11:1;
  uint16_t CNPUH12:1;
  uint16_t CNPUH13:1;
  uint16_t CNPUH14:1;
  uint16_t CNPUH15:1;
} CNPUHBITS;
extern volatile CNPUHBITS CNPUHbits __attribute__((__sfr__));

#define CNPDH CNPDH
extern volatile uint16_t CNPDH __attribute__((__sfr__));
typedef struct tagCNPDHBITS {
  uint16_t CNPDH0:1;
  uint16_t CNPDH1:1;
  uint16_t CNPDH2:1;
  uint16_t CNPDH3:1;
  uint16_t CNPDH4:1;
  uint16_t CNPDH5:1;
  uint16_t CNPDH6:1;
  uint16_t CNPDH7:1;
  uint16_t CNPDH8:1;
  uint16_t CNPDH9:1;
  uint16_t CNPDH10:1;
  uint16_t CNPDH11:1;
  uint16_t CNPDH12:1;
  uint16_t CNPDH13:1;
  uint16_t CNPDH14:1;
  uint16_t CNPDH15:1;
} CNPDHBITS;
extern volatile CNPDHBITS CNPDHbits __attribute__((__sfr__));

#define TRISJ TRISJ
extern volatile uint16_t TRISJ __attribute__((__sfr__));
typedef struct tagTRISJBITS {
  uint16_t TRISJ0:1;
  uint16_t TRISJ1:1;
  uint16_t TRISJ2:1;
  uint16_t TRISJ3:1;
  uint16_t TRISJ4:1;
  uint16_t TRISJ5:1;
  uint16_t TRISJ6:1;
  uint16_t TRISJ7:1;
  uint16_t TRISJ8:1;
  uint16_t TRISJ9:1;
  uint16_t TRISJ10:1;
  uint16_t TRISJ11:1;
  uint16_t TRISJ12:1;
  uint16_t TRISJ13:1;
  uint16_t TRISJ14:1;
  uint16_t TRISJ15:1;
} TRISJBITS;
extern volatile TRISJBITS TRISJbits __attribute__((__sfr__));

#define PORTJ PORTJ
extern volatile uint16_t PORTJ __attribute__((__sfr__));
typedef struct tagPORTJBITS {
  uint16_t RJ0:1;
  uint16_t RJ1:1;
  uint16_t RJ2:1;
  uint16_t RJ3:1;
  uint16_t RJ4:1;
  uint16_t RJ5:1;
  uint16_t RJ6:1;
  uint16_t RJ7:1;
  uint16_t RJ8:1;
  uint16_t RJ9:1;
  uint16_t RJ10:1;
  uint16_t RJ11:1;
  uint16_t RJ12:1;
  uint16_t RJ13:1;
  uint16_t RJ14:1;
  uint16_t RJ15:1;
} PORTJBITS;
extern volatile PORTJBITS PORTJbits __attribute__((__sfr__));

#define LATJ LATJ
extern volatile uint16_t LATJ __attribute__((__sfr__));
typedef struct tagLATJBITS {
  uint16_t LATJ0:1;
  uint16_t LATJ1:1;
  uint16_t LATJ2:1;
  uint16_t LATJ3:1;
  uint16_t LATJ4:1;
  uint16_t LATJ5:1;
  uint16_t LATJ6:1;
  uint16_t LATJ7:1;
  uint16_t LATJ8:1;
  uint16_t LATJ9:1;
  uint16_t LATJ10:1;
  uint16_t LATJ11:1;
  uint16_t LATJ12:1;
  uint16_t LATJ13:1;
  uint16_t LATJ14:1;
  uint16_t LATJ15:1;
} LATJBITS;
