MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
extern volatile LATJBITS LATJbits __attribute__((__sfr__));

#define ODCJ ODCJ
extern volatile uint16_t ODCJ __attribute__((__sfr__));
typedef struct tagODCJBITS {
  uint16_t ODCJ0:1;
  uint16_t ODCJ1:1;
  uint16_t ODCJ2:1;
  uint16_t ODCJ3:1;
  uint16_t ODCJ4:1;
  uint16_t ODCJ5:1;
  uint16_t ODCJ6:1;
  uint16_t ODCJ7:1;
  uint16_t ODCJ8:1;
  uint16_t ODCJ9:1;
  uint16_t ODCJ10:1;
  uint16_t ODCJ11:1;
  uint16_t ODCJ12:1;
  uint16_t ODCJ13:1;
  uint16_t ODCJ14:1;
  uint16_t ODCJ15:1;
} ODCJBITS;
extern volatile ODCJBITS ODCJbits __attribute__((__sfr__));

#define CNENJ CNENJ
extern volatile uint16_t CNENJ __attribute__((__sfr__));
typedef struct tagCNENJBITS {
  uint16_t CNIEJ0:1;
  uint16_t CNIEJ1:1;
  uint16_t CNIEJ2:1;
  uint16_t CNIEJ3:1;
  uint16_t CNIEJ4:1;
  uint16_t CNIEJ5:1;
  uint16_t CNIEJ6:1;
  uint16_t CNIEJ7:1;
  uint16_t CNIEJ8:1;
  uint16_t CNIEJ9:1;
  uint16_t CNIEJ10:1;
  uint16_t CNIEJ11:1;
  uint16_t CNIEJ12:1;
  uint16_t CNIEJ13:1;
  uint16_t CNIEJ14:1;
  uint16_t CNIEJ15:1;
} CNENJBITS;
extern volatile CNENJBITS CNENJbits __attribute__((__sfr__));

#define CNPUJ CNPUJ
extern volatile uint16_t CNPUJ __attribute__((__sfr__));
typedef struct tagCNPUJBITS {
  uint16_t CNPUJ0:1;
  uint16_t CNPUJ1:1;
  uint16_t CNPUJ2:1;
  uint16_t CNPUJ3:1;
  uint16_t CNPUJ4:1;
  uint16_t CNPUJ5:1;
  uint16_t CNPUJ6:1;
  uint16_t CNPUJ7:1;
  uint16_t CNPUJ8:1;
  uint16_t CNPUJ9:1;
  uint16_t CNPUJ10:1;
  uint16_t CNPUJ11:1;
  uint16_t CNPUJ12:1;
  uint16_t CNPUJ13:1;
  uint16_t CNPUJ14:1;
  uint16_t CNPUJ15:1;
} CNPUJBITS;
extern volatile CNPUJBITS CNPUJbits __attribute__((__sfr__));

#define CNPDJ CNPDJ
extern volatile uint16_t CNPDJ __attribute__((__sfr__));
typedef struct tagCNPDJBITS {
  uint16_t CNPDJ0:1;
  uint16_t CNPDJ1:1;
  uint16_t CNPDJ2:1;
  uint16_t CNPDJ3:1;
  uint16_t CNPDJ4:1;
  uint16_t CNPDJ5:1;
  uint16_t CNPDJ6:1;
  uint16_t CNPDJ7:1;
  uint16_t CNPDJ8:1;
  uint16_t CNPDJ9:1;
  uint16_t CNPDJ10:1;
  uint16_t CNPDJ11:1;
  uint16_t CNPDJ12:1;
  uint16_t CNPDJ13:1;
  uint16_t CNPDJ14:1;
  uint16_t CNPDJ15:1;
} CNPDJBITS;
extern volatile CNPDJBITS CNPDJbits __attribute__((__sfr__));

#define TRISK TRISK
extern volatile uint16_t TRISK __attribute__((__sfr__));
typedef struct tagTRISKBITS {
  uint16_t TRISK0:1;
  uint16_t TRISK1:1;
  uint16_t :9;
  uint16_t TRISK11:1;
  uint16_t TRISK12:1;
  uint16_t TRISK13:1;
  uint16_t TRISK14:1;
  uint16_t TRISK15:1;
} TRISKBITS;
extern volatile TRISKBITS TRISKbits __attribute__((__sfr__));

#define PORTK PORTK
extern volatile uint16_t PORTK __attribute__((__sfr__));
typedef struct tagPORTKBITS {
  uint16_t RK0:1;
  uint16_t RK1:1;
  uint16_t :9;
  uint16_t RK11:1;
  uint16_t RK12:1;
  uint16_t RK13:1;
  uint16_t RK14:1;
  uint16_t RK15:1;
} PORTKBITS;
extern volatile PORTKBITS PORTKbits __attribute__((__sfr__));

#define LATK LATK
extern volatile uint16_t LATK __attribute__((__sfr__));
typedef struct tagLATKBITS {
  uint16_t LATK0:1;
  uint16_t LATK1:1;
  uint16_t :9;
  uint16_t LATK11:1;
  uint16_t LATK12:1;
  uint16_t LATK13:1;
  uint16_t LATK14:1;
  uint16_t LATK15:1;
} LATKBITS;
extern volatile LATKBITS LATKbits __attribute__((__sfr__));

#define ODCK ODCK
extern volatile uint16_t ODCK __attribute__((__sfr__));
typedef struct tagODCKBITS {
  uint16_t ODCK0:1;
  uint16_t ODCK1:1;
  uint16_t :9;
  uint16_t ODCK11:1;
  uint16_t ODCK12:1;
  uint16_t ODCK13:1;
  uint16_t ODCK14:1;
  uint16_t ODCK15:1;
} ODCKBITS;
extern volatile ODCKBITS ODCKbits __attribute__((__sfr__));

#define CNENK CNENK
extern volatile uint16_t CNENK __attribute__((__sfr__));
typedef struct tagCNENKBITS {
  uint16_t CNIEK0:1;
  uint16_t CNIEK1:1;
  uint16_t :9;
  uint16_t CNIEK11:1;
  uint16_t CNIEK12:1;
  uint16_t CNIEK13:1;
  uint16_t CNIEK14:1;
  uint16_t CNIEK15:1;
} CNENKBITS;
extern volatile CNENKBITS CNENKbits __attribute__((__sfr__));

#define CNPUK CNPUK
extern volatile uint16_t CNPUK __attribute__((__sfr__));
typedef struct tagCNPUKBITS {
  uint16_t CNPUK0:1;
  uint16_t CNPUK1:1;
  uint16_t :9;
  uint16_t CNPUK11:1;
  uint16_t CNPUK12:1;
  uint16_t CNPUK13:1;
  uint16_t CNPUK14:1;
  uint16_t CNPUK15:1;
} CNPUKBITS;
extern volatile CNPUKBITS CNPUKbits __attribute__((__sfr__));

#define CNPDK CNPDK
extern volatile uint16_t CNPDK __attribute__((__sfr__));
typedef struct tagCNPDKBITS {
  uint16_t CNPDK0:1;
  uint16_t CNPDK1:1;
  uint16_t :9;
  uint16_t CNPDK11:1;
  uint16_t CNPDK12:1;
  uint16_t CNPDK13:1;
  uint16_t CNPDK14:1;
  uint16_t CNPDK15:1;
} CNPDKBITS;
extern volatile CNPDKBITS CNPDKbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile uint16_t PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  uint16_t PMPTTL:1;
  uint16_t RTSECSEL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define _APPO _APPO
extern volatile uint16_t _APPO __attribute__((__sfr__));
#define _APPIN _APPIN
extern volatile uint16_t _APPIN __attribute__((__sfr__));
#define APPS APPS
extern volatile uint16_t APPS __attribute__((__sfr__));
typedef struct tagAPPSBITS {
  uint16_t APIFUL:1;
  uint16_t APIOV:1;
  uint16_t APOFUL:1;
  uint16_t APOOV:1;
  uint16_t STRFUL:1;
} APPSBITS;
extern volatile APPSBITS APPSbits __attribute__((__sfr__));

#define STROUTL STROUTL
extern volatile uint16_t STROUTL __attribute__((__sfr__));
#define STROUTH STROUTH
extern volatile uint16_t STROUTH __attribute__((__sfr__));
#define STROVCNT STROVCNT
extern volatile uint16_t STROVCNT __attribute__((__sfr__));


/* ---------------------------------------------------------- */
/* Defines for unique SFR bit names                           */
/* ---------------------------------------------------------- */

/* DSRPAG */
#define _DSRPAG DSRPAGbits.DSRPAG

/* DSWPAG */
#define _DSWPAG DSWPAGbits.DSWPAG

/* SR */
#define _C SRbits.C
#define _Z SRbits.Z
#define _OV SRbits.OV
#define _N SRbits.N
#define _RA SRbits.RA
#define _IPL SRbits.IPL
/* Bitname _DC cannot be defined because it is used by more than one SFR */
#define _DA SRbits.DA
#define _SAB SRbits.SAB
#define _OAB SRbits.OAB
#define _SB SRbits.SB
#define _SA SRbits.SA
#define _OB SRbits.OB
#define _OA SRbits.OA
#define _IPL0 SRbits.IPL0
#define _IPL1 SRbits.IPL1
#define _IPL2 SRbits.IPL2

/* CORCON */
#define _IF CORCONbits.IF
#define _RND CORCONbits.RND
#define _SFA CORCONbits.SFA
#define _IPL3 CORCONbits.IPL3
#define _ACCSAT CORCONbits.ACCSAT
#define _SATDW CORCONbits.SATDW
#define _SATB CORCONbits.SATB
#define _SATA CORCONbits.SATA
#define _DL CORCONbits.DL
#define _EDT CORCONbits.EDT
#define _US CORCONbits.US
#define _VAR CORCONbits.VAR
#define _DL0 CORCONbits.DL0
#define _DL1 CORCONbits.DL1
#define _DL2 CORCONbits.DL2
#define _US0 CORCONbits.US0
#define _US1 CORCONbits.US1

/* MODCON */
#define _XWM MODCONbits.XWM
#define _YWM MODCONbits.YWM
#define _BWM MODCONbits.BWM
#define _YMODEN MODCONbits.YMODEN
#define _XMODEN MODCONbits.XMODEN
#define _XWM0 MODCONbits.XWM0
#define _XWM1 MODCONbits.XWM1
#define _XWM2 MODCONbits.XWM2
#define _XWM3 MODCONbits.XWM3
#define _YWM0 MODCONbits.YWM0
#define _YWM1 MODCONbits.YWM1
#define _YWM2 MODCONbits.YWM2
#define _YWM3 MODCONbits.YWM3
#define _BWM0 MODCONbits.BWM0
#define _BWM1 MODCONbits.BWM1
#define _BWM2 MODCONbits.BWM2
#define _BWM3 MODCONbits.BWM3

/* XBREV */
#define _XB XBREVbits.XB
#define _BREN XBREVbits.BREN
#define _XB0 XBREVbits.XB0
#define _XB1 XBREVbits.XB1
#define _XB2 XBREVbits.XB2
#define _XB3 XBREVbits.XB3
#define _XB4 XBREVbits.XB4
#define _XB5 XBREVbits.XB5
#define _XB6 XBREVbits.XB6
#define _XB7 XBREVbits.XB7
#define _XB8 XBREVbits.XB8
#define _XB9 XBREVbits.XB9
#define _XB10 XBREVbits.XB10
#define _XB11 XBREVbits.XB11
#define _XB12 XBREVbits.XB12
#define _XB13 XBREVbits.XB13
#define _XB14 XBREVbits.XB14

/* TBLPAG */
#define _TBLPAG TBLPAGbits.TBLPAG

