MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _RPOR7_RP96R2_POSITION                   0x00000002
#define _RPOR7_RP96R2_MASK                       0x00000004
#define _RPOR7_RP96R2_LENGTH                     0x00000001

#define _RPOR7_RP96R3_POSITION                   0x00000003
#define _RPOR7_RP96R3_MASK                       0x00000008
#define _RPOR7_RP96R3_LENGTH                     0x00000001

#define _RPOR7_RP96R4_POSITION                   0x00000004
#define _RPOR7_RP96R4_MASK                       0x00000010
#define _RPOR7_RP96R4_LENGTH                     0x00000001

#define _RPOR7_RP96R5_POSITION                   0x00000005
#define _RPOR7_RP96R5_MASK                       0x00000020
#define _RPOR7_RP96R5_LENGTH                     0x00000001

#define _RPOR7_RP97R0_POSITION                   0x00000008
#define _RPOR7_RP97R0_MASK                       0x00000100
#define _RPOR7_RP97R0_LENGTH                     0x00000001

#define _RPOR7_RP97R1_POSITION                   0x00000009
#define _RPOR7_RP97R1_MASK                       0x00000200
#define _RPOR7_RP97R1_LENGTH                     0x00000001

#define _RPOR7_RP97R2_POSITION                   0x0000000A
#define _RPOR7_RP97R2_MASK                       0x00000400
#define _RPOR7_RP97R2_LENGTH                     0x00000001

#define _RPOR7_RP97R3_POSITION                   0x0000000B
#define _RPOR7_RP97R3_MASK                       0x00000800
#define _RPOR7_RP97R3_LENGTH                     0x00000001

#define _RPOR7_RP97R4_POSITION                   0x0000000C
#define _RPOR7_RP97R4_MASK                       0x00001000
#define _RPOR7_RP97R4_LENGTH                     0x00000001

#define _RPOR7_RP97R5_POSITION                   0x0000000D
#define _RPOR7_RP97R5_MASK                       0x00002000
#define _RPOR7_RP97R5_LENGTH                     0x00000001

#define _RPOR8_RP98R_POSITION                    0x00000000
#define _RPOR8_RP98R_MASK                        0x0000003F
#define _RPOR8_RP98R_LENGTH                      0x00000006

#define _RPOR8_RP99R_POSITION                    0x00000008
#define _RPOR8_RP99R_MASK                        0x00003F00
#define _RPOR8_RP99R_LENGTH                      0x00000006

#define _RPOR8_RP98R0_POSITION                   0x00000000
#define _RPOR8_RP98R0_MASK                       0x00000001
#define _RPOR8_RP98R0_LENGTH                     0x00000001

#define _RPOR8_RP98R1_POSITION                   0x00000001
#define _RPOR8_RP98R1_MASK                       0x00000002
#define _RPOR8_RP98R1_LENGTH                     0x00000001

#define _RPOR8_RP98R2_POSITION                   0x00000002
#define _RPOR8_RP98R2_MASK                       0x00000004
#define _RPOR8_RP98R2_LENGTH                     0x00000001

#define _RPOR8_RP98R3_POSITION                   0x00000003
#define _RPOR8_RP98R3_MASK                       0x00000008
#define _RPOR8_RP98R3_LENGTH                     0x00000001

#define _RPOR8_RP98R4_POSITION                   0x00000004
#define _RPOR8_RP98R4_MASK                       0x00000010
#define _RPOR8_RP98R4_LENGTH                     0x00000001

#define _RPOR8_RP98R5_POSITION                   0x00000005
#define _RPOR8_RP98R5_MASK                       0x00000020
#define _RPOR8_RP98R5_LENGTH                     0x00000001

#define _RPOR8_RP99R0_POSITION                   0x00000008
#define _RPOR8_RP99R0_MASK                       0x00000100
#define _RPOR8_RP99R0_LENGTH                     0x00000001

#define _RPOR8_RP99R1_POSITION                   0x00000009
#define _RPOR8_RP99R1_MASK                       0x00000200
#define _RPOR8_RP99R1_LENGTH                     0x00000001

#define _RPOR8_RP99R2_POSITION                   0x0000000A
#define _RPOR8_RP99R2_MASK                       0x00000400
#define _RPOR8_RP99R2_LENGTH                     0x00000001

#define _RPOR8_RP99R3_POSITION                   0x0000000B
#define _RPOR8_RP99R3_MASK                       0x00000800
#define _RPOR8_RP99R3_LENGTH                     0x00000001

#define _RPOR8_RP99R4_POSITION                   0x0000000C
#define _RPOR8_RP99R4_MASK                       0x00001000
#define _RPOR8_RP99R4_LENGTH                     0x00000001

#define _RPOR8_RP99R5_POSITION                   0x0000000D
#define _RPOR8_RP99R5_MASK                       0x00002000
#define _RPOR8_RP99R5_LENGTH                     0x00000001

#define _RPOR9_RP100R_POSITION                   0x00000000
#define _RPOR9_RP100R_MASK                       0x0000003F
#define _RPOR9_RP100R_LENGTH                     0x00000006

#define _RPOR9_RP101R_POSITION                   0x00000008
#define _RPOR9_RP101R_MASK                       0x00003F00
#define _RPOR9_RP101R_LENGTH                     0x00000006

#define _RPOR9_RP100R0_POSITION                  0x00000000
#define _RPOR9_RP100R0_MASK                      0x00000001
#define _RPOR9_RP100R0_LENGTH                    0x00000001

#define _RPOR9_RP100R1_POSITION                  0x00000001
#define _RPOR9_RP100R1_MASK                      0x00000002
#define _RPOR9_RP100R1_LENGTH                    0x00000001

#define _RPOR9_RP100R2_POSITION                  0x00000002
#define _RPOR9_RP100R2_MASK                      0x00000004
#define _RPOR9_RP100R2_LENGTH                    0x00000001

#define _RPOR9_RP100R3_POSITION                  0x00000003
#define _RPOR9_RP100R3_MASK                      0x00000008
#define _RPOR9_RP100R3_LENGTH                    0x00000001

#define _RPOR9_RP100R4_POSITION                  0x00000004
#define _RPOR9_RP100R4_MASK                      0x00000010
#define _RPOR9_RP100R4_LENGTH                    0x00000001

#define _RPOR9_RP100R5_POSITION                  0x00000005
#define _RPOR9_RP100R5_MASK                      0x00000020
#define _RPOR9_RP100R5_LENGTH                    0x00000001

#define _RPOR9_RP101R0_POSITION                  0x00000008
#define _RPOR9_RP101R0_MASK                      0x00000100
#define _RPOR9_RP101R0_LENGTH                    0x00000001

#define _RPOR9_RP101R1_POSITION                  0x00000009
#define _RPOR9_RP101R1_MASK                      0x00000200
#define _RPOR9_RP101R1_LENGTH                    0x00000001

#define _RPOR9_RP101R2_POSITION                  0x0000000A
#define _RPOR9_RP101R2_MASK                      0x00000400
#define _RPOR9_RP101R2_LENGTH                    0x00000001

#define _RPOR9_RP101R3_POSITION                  0x0000000B
#define _RPOR9_RP101R3_MASK                      0x00000800
#define _RPOR9_RP101R3_LENGTH                    0x00000001

#define _RPOR9_RP101R4_POSITION                  0x0000000C
#define _RPOR9_RP101R4_MASK                      0x00001000
#define _RPOR9_RP101R4_LENGTH                    0x00000001

#define _RPOR9_RP101R5_POSITION                  0x0000000D
#define _RPOR9_RP101R5_MASK                      0x00002000
#define _RPOR9_RP101R5_LENGTH                    0x00000001

#define _RPOR11_RP104R_POSITION                  0x00000000
#define _RPOR11_RP104R_MASK                      0x0000003F
#define _RPOR11_RP104R_LENGTH                    0x00000006

#define _RPOR11_RP108R_POSITION                  0x00000008
#define _RPOR11_RP108R_MASK                      0x00003F00
#define _RPOR11_RP108R_LENGTH                    0x00000006

#define _RPOR11_RP104R0_POSITION                 0x00000000
#define _RPOR11_RP104R0_MASK                     0x00000001
#define _RPOR11_RP104R0_LENGTH                   0x00000001

#define _RPOR11_RP104R1_POSITION                 0x00000001
#define _RPOR11_RP104R1_MASK                     0x00000002
#define _RPOR11_RP104R1_LENGTH                   0x00000001

