MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _RPINR31_SCK4R2_POSITION                 0x0000000A
#define _RPINR31_SCK4R2_MASK                     0x00000400
#define _RPINR31_SCK4R2_LENGTH                   0x00000001

#define _RPINR31_SCK4R3_POSITION                 0x0000000B
#define _RPINR31_SCK4R3_MASK                     0x00000800
#define _RPINR31_SCK4R3_LENGTH                   0x00000001

#define _RPINR31_SCK4R4_POSITION                 0x0000000C
#define _RPINR31_SCK4R4_MASK                     0x00001000
#define _RPINR31_SCK4R4_LENGTH                   0x00000001

#define _RPINR31_SCK4R5_POSITION                 0x0000000D
#define _RPINR31_SCK4R5_MASK                     0x00002000
#define _RPINR31_SCK4R5_LENGTH                   0x00000001

#define _RPINR31_SCK4R6_POSITION                 0x0000000E
#define _RPINR31_SCK4R6_MASK                     0x00004000
#define _RPINR31_SCK4R6_LENGTH                   0x00000001

#define _RPINR32_SS4R_POSITION                   0x00000000
#define _RPINR32_SS4R_MASK                       0x0000007F
#define _RPINR32_SS4R_LENGTH                     0x00000007

#define _RPINR32_SS4R0_POSITION                  0x00000000
#define _RPINR32_SS4R0_MASK                      0x00000001
#define _RPINR32_SS4R0_LENGTH                    0x00000001

#define _RPINR32_SS4R1_POSITION                  0x00000001
#define _RPINR32_SS4R1_MASK                      0x00000002
#define _RPINR32_SS4R1_LENGTH                    0x00000001

#define _RPINR32_SS4R2_POSITION                  0x00000002
#define _RPINR32_SS4R2_MASK                      0x00000004
#define _RPINR32_SS4R2_LENGTH                    0x00000001

#define _RPINR32_SS4R3_POSITION                  0x00000003
#define _RPINR32_SS4R3_MASK                      0x00000008
#define _RPINR32_SS4R3_LENGTH                    0x00000001

#define _RPINR32_SS4R4_POSITION                  0x00000004
#define _RPINR32_SS4R4_MASK                      0x00000010
#define _RPINR32_SS4R4_LENGTH                    0x00000001

#define _RPINR32_SS4R5_POSITION                  0x00000005
#define _RPINR32_SS4R5_MASK                      0x00000020
#define _RPINR32_SS4R5_LENGTH                    0x00000001

#define _RPINR32_SS4R6_POSITION                  0x00000006
#define _RPINR32_SS4R6_MASK                      0x00000040
#define _RPINR32_SS4R6_LENGTH                    0x00000001

#define _RPINR33_IC9R_POSITION                   0x00000000
#define _RPINR33_IC9R_MASK                       0x0000007F
#define _RPINR33_IC9R_LENGTH                     0x00000007

#define _RPINR33_IC10R_POSITION                  0x00000008
#define _RPINR33_IC10R_MASK                      0x00007F00
#define _RPINR33_IC10R_LENGTH                    0x00000007

#define _RPINR33_IC9R0_POSITION                  0x00000000
#define _RPINR33_IC9R0_MASK                      0x00000001
#define _RPINR33_IC9R0_LENGTH                    0x00000001

#define _RPINR33_IC9R1_POSITION                  0x00000001
#define _RPINR33_IC9R1_MASK                      0x00000002
#define _RPINR33_IC9R1_LENGTH                    0x00000001

#define _RPINR33_IC9R2_POSITION                  0x00000002
#define _RPINR33_IC9R2_MASK                      0x00000004
#define _RPINR33_IC9R2_LENGTH                    0x00000001

#define _RPINR33_IC9R3_POSITION                  0x00000003
#define _RPINR33_IC9R3_MASK                      0x00000008
#define _RPINR33_IC9R3_LENGTH                    0x00000001

#define _RPINR33_IC9R4_POSITION                  0x00000004
#define _RPINR33_IC9R4_MASK                      0x00000010
#define _RPINR33_IC9R4_LENGTH                    0x00000001

#define _RPINR33_IC9R5_POSITION                  0x00000005
#define _RPINR33_IC9R5_MASK                      0x00000020
#define _RPINR33_IC9R5_LENGTH                    0x00000001

#define _RPINR33_IC9R6_POSITION                  0x00000006
#define _RPINR33_IC9R6_MASK                      0x00000040
#define _RPINR33_IC9R6_LENGTH                    0x00000001

#define _RPINR33_IC10R0_POSITION                 0x00000008
#define _RPINR33_IC10R0_MASK                     0x00000100
#define _RPINR33_IC10R0_LENGTH                   0x00000001

#define _RPINR33_IC10R1_POSITION                 0x00000009
#define _RPINR33_IC10R1_MASK                     0x00000200
#define _RPINR33_IC10R1_LENGTH                   0x00000001

#define _RPINR33_IC10R2_POSITION                 0x0000000A
#define _RPINR33_IC10R2_MASK                     0x00000400
#define _RPINR33_IC10R2_LENGTH                   0x00000001

#define _RPINR33_IC10R3_POSITION                 0x0000000B
#define _RPINR33_IC10R3_MASK                     0x00000800
#define _RPINR33_IC10R3_LENGTH                   0x00000001

#define _RPINR33_IC10R4_POSITION                 0x0000000C
#define _RPINR33_IC10R4_MASK                     0x00001000
#define _RPINR33_IC10R4_LENGTH                   0x00000001

#define _RPINR33_IC10R5_POSITION                 0x0000000D
#define _RPINR33_IC10R5_MASK                     0x00002000
#define _RPINR33_IC10R5_LENGTH                   0x00000001

#define _RPINR33_IC10R6_POSITION                 0x0000000E
#define _RPINR33_IC10R6_MASK                     0x00004000
#define _RPINR33_IC10R6_LENGTH                   0x00000001

#define _RPINR34_IC11R_POSITION                  0x00000000
#define _RPINR34_IC11R_MASK                      0x0000007F
#define _RPINR34_IC11R_LENGTH                    0x00000007

#define _RPINR34_IC12R_POSITION                  0x00000008
#define _RPINR34_IC12R_MASK                      0x00007F00
#define _RPINR34_IC12R_LENGTH                    0x00000007

#define _RPINR34_IC11R0_POSITION                 0x00000000
#define _RPINR34_IC11R0_MASK                     0x00000001
#define _RPINR34_IC11R0_LENGTH                   0x00000001

#define _RPINR34_IC11R1_POSITION                 0x00000001
#define _RPINR34_IC11R1_MASK                     0x00000002
#define _RPINR34_IC11R1_LENGTH                   0x00000001

#define _RPINR34_IC11R2_POSITION                 0x00000002
#define _RPINR34_IC11R2_MASK                     0x00000004
#define _RPINR34_IC11R2_LENGTH                   0x00000001

