MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _PLLFBD_PLLDIV7_POSITION                 0x00000007
#define _PLLFBD_PLLDIV7_MASK                     0x00000080
#define _PLLFBD_PLLDIV7_LENGTH                   0x00000001

#define _PLLFBD_PLLDIV8_POSITION                 0x00000008
#define _PLLFBD_PLLDIV8_MASK                     0x00000100
#define _PLLFBD_PLLDIV8_LENGTH                   0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TUN4_POSITION                    0x00000004
#define _OSCTUN_TUN4_MASK                        0x00000010
#define _OSCTUN_TUN4_LENGTH                      0x00000001

#define _OSCTUN_TUN5_POSITION                    0x00000005
#define _OSCTUN_TUN5_MASK                        0x00000020
#define _OSCTUN_TUN5_LENGTH                      0x00000001

#define _REFOCON_RODIV_POSITION                  0x00000008
#define _REFOCON_RODIV_MASK                      0x00000F00
#define _REFOCON_RODIV_LENGTH                    0x00000004

#define _REFOCON_ROSEL_POSITION                  0x0000000C
#define _REFOCON_ROSEL_MASK                      0x00001000
#define _REFOCON_ROSEL_LENGTH                    0x00000001

#define _REFOCON_ROSSLP_POSITION                 0x0000000D
#define _REFOCON_ROSSLP_MASK                     0x00002000
#define _REFOCON_ROSSLP_LENGTH                   0x00000001

#define _REFOCON_ROON_POSITION                   0x0000000F
#define _REFOCON_ROON_MASK                       0x00008000
#define _REFOCON_ROON_LENGTH                     0x00000001

#define _REFOCON_RODIV0_POSITION                 0x00000008
#define _REFOCON_RODIV0_MASK                     0x00000100
#define _REFOCON_RODIV0_LENGTH                   0x00000001

#define _REFOCON_RODIV1_POSITION                 0x00000009
#define _REFOCON_RODIV1_MASK                     0x00000200
#define _REFOCON_RODIV1_LENGTH                   0x00000001

#define _REFOCON_RODIV2_POSITION                 0x0000000A
#define _REFOCON_RODIV2_MASK                     0x00000400
#define _REFOCON_RODIV2_LENGTH                   0x00000001

#define _REFOCON_RODIV3_POSITION                 0x0000000B
#define _REFOCON_RODIV3_MASK                     0x00000800
#define _REFOCON_RODIV3_LENGTH                   0x00000001

#define _ACLKCON3_APLLPRE_POSITION               0x00000000
#define _ACLKCON3_APLLPRE_MASK                   0x00000007
#define _ACLKCON3_APLLPRE_LENGTH                 0x00000003

#define _ACLKCON3_APLLPOST_POSITION              0x00000005
#define _ACLKCON3_APLLPOST_MASK                  0x000000E0
#define _ACLKCON3_APLLPOST_LENGTH                0x00000003

#define _ACLKCON3_FRCSEL_POSITION                0x00000009
#define _ACLKCON3_FRCSEL_MASK                    0x00000200
#define _ACLKCON3_FRCSEL_LENGTH                  0x00000001

#define _ACLKCON3_ASRCSEL_POSITION               0x0000000A
#define _ACLKCON3_ASRCSEL_MASK                   0x00000400
#define _ACLKCON3_ASRCSEL_LENGTH                 0x00000001

#define _ACLKCON3_AOSCMD_POSITION                0x0000000B
#define _ACLKCON3_AOSCMD_MASK                    0x00001800
#define _ACLKCON3_AOSCMD_LENGTH                  0x00000002

#define _ACLKCON3_SELACLK_POSITION               0x0000000D
#define _ACLKCON3_SELACLK_MASK                   0x00002000
#define _ACLKCON3_SELACLK_LENGTH                 0x00000001

#define _ACLKCON3_APLLCK_POSITION                0x0000000E
#define _ACLKCON3_APLLCK_MASK                    0x00004000
#define _ACLKCON3_APLLCK_LENGTH                  0x00000001

#define _ACLKCON3_ENAPLL_POSITION                0x0000000F
#define _ACLKCON3_ENAPLL_MASK                    0x00008000
#define _ACLKCON3_ENAPLL_LENGTH                  0x00000001

#define _ACLKCON3_APPLPRE0_POSITION              0x00000000
#define _ACLKCON3_APPLPRE0_MASK                  0x00000001
#define _ACLKCON3_APPLPRE0_LENGTH                0x00000001

#define _ACLKCON3_APPLPRE1_POSITION              0x00000001
#define _ACLKCON3_APPLPRE1_MASK                  0x00000002
#define _ACLKCON3_APPLPRE1_LENGTH                0x00000001

#define _ACLKCON3_APPLPRE2_POSITION              0x00000002
#define _ACLKCON3_APPLPRE2_MASK                  0x00000004
#define _ACLKCON3_APPLPRE2_LENGTH                0x00000001

#define _ACLKCON3_APLLPOST0_POSITION             0x00000005
#define _ACLKCON3_APLLPOST0_MASK                 0x00000020
#define _ACLKCON3_APLLPOST0_LENGTH               0x00000001

#define _ACLKCON3_APLLPOST1_POSITION             0x00000006
#define _ACLKCON3_APLLPOST1_MASK                 0x00000040
#define _ACLKCON3_APLLPOST1_LENGTH               0x00000001

#define _ACLKCON3_APLLPOST2_POSITION             0x00000007
#define _ACLKCON3_APLLPOST2_MASK                 0x00000080
#define _ACLKCON3_APLLPOST2_LENGTH               0x00000001

#define _ACLKCON3_AOSCMD0_POSITION               0x0000000B
#define _ACLKCON3_AOSCMD0_MASK                   0x00000800
#define _ACLKCON3_AOSCMD0_LENGTH                 0x00000001

#define _ACLKCON3_AOSCMD1_POSITION               0x0000000C
#define _ACLKCON3_AOSCMD1_MASK                   0x00001000
#define _ACLKCON3_AOSCMD1_LENGTH                 0x00000001

#define _ACLKDIV3_APLLDIV_POSITION               0x00000000
#define _ACLKDIV3_APLLDIV_MASK                   0x00000007
#define _ACLKDIV3_APLLDIV_LENGTH                 0x00000003

