MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _IEC7_DMA11IE_POSITION                   0x00000009
#define _IEC7_DMA11IE_MASK                       0x00000200
#define _IEC7_DMA11IE_LENGTH                     0x00000001

#define _IEC7_SPI4EIE_POSITION                   0x0000000A
#define _IEC7_SPI4EIE_MASK                       0x00000400
#define _IEC7_SPI4EIE_LENGTH                     0x00000001

#define _IEC7_SPI4IE_POSITION                    0x0000000B
#define _IEC7_SPI4IE_MASK                        0x00000800
#define _IEC7_SPI4IE_LENGTH                      0x00000001

#define _IEC7_OC10IE_POSITION                    0x0000000C
#define _IEC7_OC10IE_MASK                        0x00001000
#define _IEC7_OC10IE_LENGTH                      0x00000001

#define _IEC7_IC10IE_POSITION                    0x0000000D
#define _IEC7_IC10IE_MASK                        0x00002000
#define _IEC7_IC10IE_LENGTH                      0x00000001

#define _IEC7_OC11IE_POSITION                    0x0000000E
#define _IEC7_OC11IE_MASK                        0x00004000
#define _IEC7_OC11IE_LENGTH                      0x00000001

#define _IEC7_IC11IE_POSITION                    0x0000000F
#define _IEC7_IC11IE_MASK                        0x00008000
#define _IEC7_IC11IE_LENGTH                      0x00000001

#define _IEC8_OC12IE_POSITION                    0x00000000
#define _IEC8_OC12IE_MASK                        0x00000001
#define _IEC8_OC12IE_LENGTH                      0x00000001

#define _IEC8_IC12IE_POSITION                    0x00000001
#define _IEC8_IC12IE_MASK                        0x00000002
#define _IEC8_IC12IE_LENGTH                      0x00000001

#define _IEC8_DMA12IE_POSITION                   0x00000002
#define _IEC8_DMA12IE_MASK                       0x00000004
#define _IEC8_DMA12IE_LENGTH                     0x00000001

#define _IEC8_DMA13IE_POSITION                   0x00000003
#define _IEC8_DMA13IE_MASK                       0x00000008
#define _IEC8_DMA13IE_LENGTH                     0x00000001

#define _IEC8_DMA14IE_POSITION                   0x00000004
#define _IEC8_DMA14IE_MASK                       0x00000010
#define _IEC8_DMA14IE_LENGTH                     0x00000001

#define _IEC8_OC13IE_POSITION                    0x00000006
#define _IEC8_OC13IE_MASK                        0x00000040
#define _IEC8_OC13IE_LENGTH                      0x00000001

#define _IEC8_IC13IE_POSITION                    0x00000007
#define _IEC8_IC13IE_MASK                        0x00000080
#define _IEC8_IC13IE_LENGTH                      0x00000001

#define _IEC8_OC14IE_POSITION                    0x00000008
#define _IEC8_OC14IE_MASK                        0x00000100
#define _IEC8_OC14IE_LENGTH                      0x00000001

#define _IEC8_IC14IE_POSITION                    0x00000009
#define _IEC8_IC14IE_MASK                        0x00000200
#define _IEC8_IC14IE_LENGTH                      0x00000001

#define _IEC8_OC15IE_POSITION                    0x0000000A
#define _IEC8_OC15IE_MASK                        0x00000400
#define _IEC8_OC15IE_LENGTH                      0x00000001

#define _IEC8_IC15IE_POSITION                    0x0000000B
#define _IEC8_IC15IE_MASK                        0x00000800
#define _IEC8_IC15IE_LENGTH                      0x00000001

#define _IEC8_OC16IE_POSITION                    0x0000000C
#define _IEC8_OC16IE_MASK                        0x00001000
#define _IEC8_OC16IE_LENGTH                      0x00000001

#define _IEC8_IC16IE_POSITION                    0x0000000D
#define _IEC8_IC16IE_MASK                        0x00002000
#define _IEC8_IC16IE_LENGTH                      0x00000001

#define _IEC8_ICDIF_POSITION                     0x0000000E
#define _IEC8_ICDIF_MASK                         0x00004000
#define _IEC8_ICDIF_LENGTH                       0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

#define _IPC0_INT0IP2_POSITION                   0x00000002
#define _IPC0_INT0IP2_MASK                       0x00000004
#define _IPC0_INT0IP2_LENGTH                     0x00000001

#define _IPC0_IC1IP0_POSITION                    0x00000004
#define _IPC0_IC1IP0_MASK                        0x00000010
#define _IPC0_IC1IP0_LENGTH                      0x00000001

#define _IPC0_IC1IP1_POSITION                    0x00000005
#define _IPC0_IC1IP1_MASK                        0x00000020
#define _IPC0_IC1IP1_LENGTH                      0x00000001

#define _IPC0_IC1IP2_POSITION                    0x00000006
#define _IPC0_IC1IP2_MASK                        0x00000040
#define _IPC0_IC1IP2_LENGTH                      0x00000001

#define _IPC0_OC1IP0_POSITION                    0x00000008
#define _IPC0_OC1IP0_MASK                        0x00000100
#define _IPC0_OC1IP0_LENGTH                      0x00000001

#define _IPC0_OC1IP1_POSITION                    0x00000009
#define _IPC0_OC1IP1_MASK                        0x00000200
#define _IPC0_OC1IP1_LENGTH                      0x00000001

#define _IPC0_OC1IP2_POSITION                    0x0000000A
#define _IPC0_OC1IP2_MASK                        0x00000400
#define _IPC0_OC1IP2_LENGTH                      0x00000001

#define _IPC0_T1IP0_POSITION                     0x0000000C
#define _IPC0_T1IP0_MASK                         0x00001000
#define _IPC0_T1IP0_LENGTH                       0x00000001

#define _IPC0_T1IP1_POSITION                     0x0000000D
#define _IPC0_T1IP1_MASK                         0x00002000
#define _IPC0_T1IP1_LENGTH                       0x00000001

#define _IPC0_T1IP2_POSITION                     0x0000000E
#define _IPC0_T1IP2_MASK                         0x00004000
#define _IPC0_T1IP2_LENGTH                       0x00000001

#define _IPC1_DMA0IP_POSITION                    0x00000000
#define _IPC1_DMA0IP_MASK                        0x00000007
#define _IPC1_DMA0IP_LENGTH                      0x00000003

#define _IPC1_IC2IP_POSITION                     0x00000004
#define _IPC1_IC2IP_MASK                         0x00000070
#define _IPC1_IC2IP_LENGTH                       0x00000003

#define _IPC1_OC2IP_POSITION                     0x00000008
#define _IPC1_OC2IP_MASK                         0x00000700
#define _IPC1_OC2IP_LENGTH                       0x00000003

#define _IPC1_T2IP_POSITION                      0x0000000C
#define _IPC1_T2IP_MASK                          0x00007000
#define _IPC1_T2IP_LENGTH                        0x00000003

#define _IPC1_DMA0IP0_POSITION                   0x00000000
#define _IPC1_DMA0IP0_MASK                       0x00000001
#define _IPC1_DMA0IP0_LENGTH                     0x00000001

#define _IPC1_DMA0IP1_POSITION                   0x00000001
#define _IPC1_DMA0IP1_MASK                       0x00000002
#define _IPC1_DMA0IP1_LENGTH                     0x00000001

#define _IPC1_DMA0IP2_POSITION                   0x00000002
#define _IPC1_DMA0IP2_MASK                       0x00000004
#define _IPC1_DMA0IP2_LENGTH                     0x00000001

#define _IPC1_IC2IP0_POSITION                    0x00000004
#define _IPC1_IC2IP0_MASK                        0x00000010
#define _IPC1_IC2IP0_LENGTH                      0x00000001

#define _IPC1_IC2IP1_POSITION                    0x00000005
#define _IPC1_IC2IP1_MASK                        0x00000020
#define _IPC1_IC2IP1_LENGTH                      0x00000001

#define _IPC1_IC2IP2_POSITION                    0x00000006
#define _IPC1_IC2IP2_MASK                        0x00000040
#define _IPC1_IC2IP2_LENGTH                      0x00000001

#define _IPC1_OC2IP0_POSITION                    0x00000008
#define _IPC1_OC2IP0_MASK                        0x00000100
#define _IPC1_OC2IP0_LENGTH                      0x00000001

#define _IPC1_OC2IP1_POSITION                    0x00000009
#define _IPC1_OC2IP1_MASK                        0x00000200
#define _IPC1_OC2IP1_LENGTH                      0x00000001

