MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _DMA9CON_CHEN_POSITION                   0x0000000F
#define _DMA9CON_CHEN_MASK                       0x00008000
#define _DMA9CON_CHEN_LENGTH                     0x00000001

#define _DMA9CON_MODE0_POSITION                  0x00000000
#define _DMA9CON_MODE0_MASK                      0x00000001
#define _DMA9CON_MODE0_LENGTH                    0x00000001

#define _DMA9CON_MODE1_POSITION                  0x00000001
#define _DMA9CON_MODE1_MASK                      0x00000002
#define _DMA9CON_MODE1_LENGTH                    0x00000001

#define _DMA9CON_AMODE0_POSITION                 0x00000004
#define _DMA9CON_AMODE0_MASK                     0x00000010
#define _DMA9CON_AMODE0_LENGTH                   0x00000001

#define _DMA9CON_AMODE1_POSITION                 0x00000005
#define _DMA9CON_AMODE1_MASK                     0x00000020
#define _DMA9CON_AMODE1_LENGTH                   0x00000001

#define _DMA9REQ_IRQSEL_POSITION                 0x00000000
#define _DMA9REQ_IRQSEL_MASK                     0x000000FF
#define _DMA9REQ_IRQSEL_LENGTH                   0x00000008

#define _DMA9REQ_FORCE_POSITION                  0x0000000F
#define _DMA9REQ_FORCE_MASK                      0x00008000
#define _DMA9REQ_FORCE_LENGTH                    0x00000001

#define _DMA9REQ_IRQSEL0_POSITION                0x00000000
#define _DMA9REQ_IRQSEL0_MASK                    0x00000001
#define _DMA9REQ_IRQSEL0_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL1_POSITION                0x00000001
#define _DMA9REQ_IRQSEL1_MASK                    0x00000002
#define _DMA9REQ_IRQSEL1_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL2_POSITION                0x00000002
#define _DMA9REQ_IRQSEL2_MASK                    0x00000004
#define _DMA9REQ_IRQSEL2_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL3_POSITION                0x00000003
#define _DMA9REQ_IRQSEL3_MASK                    0x00000008
#define _DMA9REQ_IRQSEL3_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL4_POSITION                0x00000004
#define _DMA9REQ_IRQSEL4_MASK                    0x00000010
#define _DMA9REQ_IRQSEL4_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL5_POSITION                0x00000005
#define _DMA9REQ_IRQSEL5_MASK                    0x00000020
#define _DMA9REQ_IRQSEL5_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL6_POSITION                0x00000006
#define _DMA9REQ_IRQSEL6_MASK                    0x00000040
#define _DMA9REQ_IRQSEL6_LENGTH                  0x00000001

#define _DMA9REQ_IRQSEL7_POSITION                0x00000007
#define _DMA9REQ_IRQSEL7_MASK                    0x00000080
#define _DMA9REQ_IRQSEL7_LENGTH                  0x00000001

#define _DMA9STAH_STA_POSITION                   0x00000000
#define _DMA9STAH_STA_MASK                       0x000000FF
#define _DMA9STAH_STA_LENGTH                     0x00000008

#define _DMA9STBH_STB_POSITION                   0x00000000
#define _DMA9STBH_STB_MASK                       0x000000FF
#define _DMA9STBH_STB_LENGTH                     0x00000008

#define _DMA9CNT_CNT_POSITION                    0x00000000
#define _DMA9CNT_CNT_MASK                        0x00003FFF
#define _DMA9CNT_CNT_LENGTH                      0x0000000E

#define _DMA10CON_MODE_POSITION                  0x00000000
#define _DMA10CON_MODE_MASK                      0x00000003
#define _DMA10CON_MODE_LENGTH                    0x00000002

#define _DMA10CON_AMODE_POSITION                 0x00000004
#define _DMA10CON_AMODE_MASK                     0x00000030
#define _DMA10CON_AMODE_LENGTH                   0x00000002

#define _DMA10CON_NULLW_POSITION                 0x0000000B
#define _DMA10CON_NULLW_MASK                     0x00000800
#define _DMA10CON_NULLW_LENGTH                   0x00000001

#define _DMA10CON_HALF_POSITION                  0x0000000C
#define _DMA10CON_HALF_MASK                      0x00001000
#define _DMA10CON_HALF_LENGTH                    0x00000001

#define _DMA10CON_DIR_POSITION                   0x0000000D
#define _DMA10CON_DIR_MASK                       0x00002000
#define _DMA10CON_DIR_LENGTH                     0x00000001

#define _DMA10CON_SIZE_POSITION                  0x0000000E
#define _DMA10CON_SIZE_MASK                      0x00004000
#define _DMA10CON_SIZE_LENGTH                    0x00000001

#define _DMA10CON_CHEN_POSITION                  0x0000000F
#define _DMA10CON_CHEN_MASK                      0x00008000
#define _DMA10CON_CHEN_LENGTH                    0x00000001

#define _DMA10CON_MODE0_POSITION                 0x00000000
#define _DMA10CON_MODE0_MASK                     0x00000001
#define _DMA10CON_MODE0_LENGTH                   0x00000001

#define _DMA10CON_MODE1_POSITION                 0x00000001
#define _DMA10CON_MODE1_MASK                     0x00000002
#define _DMA10CON_MODE1_LENGTH                   0x00000001

#define _DMA10CON_AMODE0_POSITION                0x00000004
#define _DMA10CON_AMODE0_MASK                    0x00000010
#define _DMA10CON_AMODE0_LENGTH                  0x00000001

#define _DMA10CON_AMODE1_POSITION                0x00000005
#define _DMA10CON_AMODE1_MASK                    0x00000020
#define _DMA10CON_AMODE1_LENGTH                  0x00000001

#define _DMA10REQ_IRQSEL_POSITION                0x00000000
#define _DMA10REQ_IRQSEL_MASK                    0x000000FF
#define _DMA10REQ_IRQSEL_LENGTH                  0x00000008

#define _DMA10REQ_FORCE_POSITION                 0x0000000F
#define _DMA10REQ_FORCE_MASK                     0x00008000
#define _DMA10REQ_FORCE_LENGTH                   0x00000001

#define _DMA10REQ_IRQSEL0_POSITION               0x00000000
#define _DMA10REQ_IRQSEL0_MASK                   0x00000001
#define _DMA10REQ_IRQSEL0_LENGTH                 0x00000001

#define _DMA10REQ_IRQSEL1_POSITION               0x00000001
#define _DMA10REQ_IRQSEL1_MASK                   0x00000002
#define _DMA10REQ_IRQSEL1_LENGTH                 0x00000001

#define _DMA10REQ_IRQSEL2_POSITION               0x00000002
#define _DMA10REQ_IRQSEL2_MASK                   0x00000004
#define _DMA10REQ_IRQSEL2_LENGTH                 0x00000001

#define _DMA10REQ_IRQSEL3_POSITION               0x00000003
#define _DMA10REQ_IRQSEL3_MASK                   0x00000008
#define _DMA10REQ_IRQSEL3_LENGTH                 0x00000001

#define _DMA10REQ_IRQSEL4_POSITION               0x00000004
#define _DMA10REQ_IRQSEL4_MASK                   0x00000010
#define _DMA10REQ_IRQSEL4_LENGTH                 0x00000001

