MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _LEBDLY5_LEB0_POSITION                   0x00000003
#define _LEBDLY5_LEB0_MASK                       0x00000008
#define _LEBDLY5_LEB0_LENGTH                     0x00000001

#define _LEBDLY5_LEB1_POSITION                   0x00000004
#define _LEBDLY5_LEB1_MASK                       0x00000010
#define _LEBDLY5_LEB1_LENGTH                     0x00000001

#define _LEBDLY5_LEB2_POSITION                   0x00000005
#define _LEBDLY5_LEB2_MASK                       0x00000020
#define _LEBDLY5_LEB2_LENGTH                     0x00000001

#define _LEBDLY5_LEB3_POSITION                   0x00000006
#define _LEBDLY5_LEB3_MASK                       0x00000040
#define _LEBDLY5_LEB3_LENGTH                     0x00000001

#define _LEBDLY5_LEB4_POSITION                   0x00000007
#define _LEBDLY5_LEB4_MASK                       0x00000080
#define _LEBDLY5_LEB4_LENGTH                     0x00000001

#define _LEBDLY5_LEB5_POSITION                   0x00000008
#define _LEBDLY5_LEB5_MASK                       0x00000100
#define _LEBDLY5_LEB5_LENGTH                     0x00000001

#define _LEBDLY5_LEB6_POSITION                   0x00000009
#define _LEBDLY5_LEB6_MASK                       0x00000200
#define _LEBDLY5_LEB6_LENGTH                     0x00000001

#define _LEBDLY5_LEB7_POSITION                   0x0000000A
#define _LEBDLY5_LEB7_MASK                       0x00000400
#define _LEBDLY5_LEB7_LENGTH                     0x00000001

#define _LEBDLY5_LEB8_POSITION                   0x0000000B
#define _LEBDLY5_LEB8_MASK                       0x00000800
#define _LEBDLY5_LEB8_LENGTH                     0x00000001

#define _AUXCON5_CHOPLEN_POSITION                0x00000000
#define _AUXCON5_CHOPLEN_MASK                    0x00000001
#define _AUXCON5_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON5_CHOPHEN_POSITION                0x00000001
#define _AUXCON5_CHOPHEN_MASK                    0x00000002
#define _AUXCON5_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON5_CHOPSEL_POSITION                0x00000002
#define _AUXCON5_CHOPSEL_MASK                    0x0000003C
#define _AUXCON5_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON5_BLANKSEL_POSITION               0x00000008
#define _AUXCON5_BLANKSEL_MASK                   0x00000F00
#define _AUXCON5_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON5_CHOPSEL0_POSITION               0x00000002
#define _AUXCON5_CHOPSEL0_MASK                   0x00000004
#define _AUXCON5_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON5_CHOPSEL1_POSITION               0x00000003
#define _AUXCON5_CHOPSEL1_MASK                   0x00000008
#define _AUXCON5_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON5_CHOPSEL2_POSITION               0x00000004
#define _AUXCON5_CHOPSEL2_MASK                   0x00000010
#define _AUXCON5_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON5_CHOPSEL3_POSITION               0x00000005
#define _AUXCON5_CHOPSEL3_MASK                   0x00000020
#define _AUXCON5_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON5_BLANKSEL0_POSITION              0x00000008
#define _AUXCON5_BLANKSEL0_MASK                  0x00000100
#define _AUXCON5_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON5_BLANKSEL1_POSITION              0x00000009
#define _AUXCON5_BLANKSEL1_MASK                  0x00000200
#define _AUXCON5_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON5_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON5_BLANKSEL2_MASK                  0x00000400
#define _AUXCON5_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON5_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON5_BLANKSEL3_MASK                  0x00000800
#define _AUXCON5_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON6_IUE_POSITION                    0x00000000
#define _PWMCON6_IUE_MASK                        0x00000001
#define _PWMCON6_IUE_LENGTH                      0x00000001

#define _PWMCON6_XPRES_POSITION                  0x00000001
#define _PWMCON6_XPRES_MASK                      0x00000002
#define _PWMCON6_XPRES_LENGTH                    0x00000001

#define _PWMCON6_CAM_POSITION                    0x00000002
#define _PWMCON6_CAM_MASK                        0x00000004
#define _PWMCON6_CAM_LENGTH                      0x00000001

#define _PWMCON6_MTBS_POSITION                   0x00000003
#define _PWMCON6_MTBS_MASK                       0x00000008
#define _PWMCON6_MTBS_LENGTH                     0x00000001

#define _PWMCON6_DTCP_POSITION                   0x00000005
#define _PWMCON6_DTCP_MASK                       0x00000020
#define _PWMCON6_DTCP_LENGTH                     0x00000001

#define _PWMCON6_DTC_POSITION                    0x00000006
#define _PWMCON6_DTC_MASK                        0x000000C0
#define _PWMCON6_DTC_LENGTH                      0x00000002

#define _PWMCON6_MDCS_POSITION                   0x00000008
#define _PWMCON6_MDCS_MASK                       0x00000100
#define _PWMCON6_MDCS_LENGTH                     0x00000001

#define _PWMCON6_ITB_POSITION                    0x00000009
#define _PWMCON6_ITB_MASK                        0x00000200
#define _PWMCON6_ITB_LENGTH                      0x00000001

#define _PWMCON6_TRGIEN_POSITION                 0x0000000A
#define _PWMCON6_TRGIEN_MASK                     0x00000400
#define _PWMCON6_TRGIEN_LENGTH                   0x00000001

#define _PWMCON6_CLIEN_POSITION                  0x0000000B
#define _PWMCON6_CLIEN_MASK                      0x00000800
#define _PWMCON6_CLIEN_LENGTH                    0x00000001

#define _PWMCON6_FLTIEN_POSITION                 0x0000000C
#define _PWMCON6_FLTIEN_MASK                     0x00001000
#define _PWMCON6_FLTIEN_LENGTH                   0x00000001

#define _PWMCON6_TRGSTAT_POSITION                0x0000000D
#define _PWMCON6_TRGSTAT_MASK                    0x00002000
#define _PWMCON6_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON6_CLSTAT_POSITION                 0x0000000E
#define _PWMCON6_CLSTAT_MASK                     0x00004000
#define _PWMCON6_CLSTAT_LENGTH                   0x00000001

#define _PWMCON6_FLTSTAT_POSITION                0x0000000F
#define _PWMCON6_FLTSTAT_MASK                    0x00008000
#define _PWMCON6_FLTSTAT_LENGTH                  0x00000001

