MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _PWMCAP6_PWMCAP1_POSITION                0x00000004
#define _PWMCAP6_PWMCAP1_MASK                    0x00000010
#define _PWMCAP6_PWMCAP1_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP2_POSITION                0x00000005
#define _PWMCAP6_PWMCAP2_MASK                    0x00000020
#define _PWMCAP6_PWMCAP2_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP3_POSITION                0x00000006
#define _PWMCAP6_PWMCAP3_MASK                    0x00000040
#define _PWMCAP6_PWMCAP3_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP4_POSITION                0x00000007
#define _PWMCAP6_PWMCAP4_MASK                    0x00000080
#define _PWMCAP6_PWMCAP4_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP5_POSITION                0x00000008
#define _PWMCAP6_PWMCAP5_MASK                    0x00000100
#define _PWMCAP6_PWMCAP5_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP6_POSITION                0x00000009
#define _PWMCAP6_PWMCAP6_MASK                    0x00000200
#define _PWMCAP6_PWMCAP6_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP7_POSITION                0x0000000A
#define _PWMCAP6_PWMCAP7_MASK                    0x00000400
#define _PWMCAP6_PWMCAP7_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP8_POSITION                0x0000000B
#define _PWMCAP6_PWMCAP8_MASK                    0x00000800
#define _PWMCAP6_PWMCAP8_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP9_POSITION                0x0000000C
#define _PWMCAP6_PWMCAP9_MASK                    0x00001000
#define _PWMCAP6_PWMCAP9_LENGTH                  0x00000001

#define _PWMCAP6_PWMCAP10_POSITION               0x0000000D
#define _PWMCAP6_PWMCAP10_MASK                   0x00002000
#define _PWMCAP6_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP6_PWMCAP11_POSITION               0x0000000E
#define _PWMCAP6_PWMCAP11_MASK                   0x00004000
#define _PWMCAP6_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP6_PWMCAP12_POSITION               0x0000000F
#define _PWMCAP6_PWMCAP12_MASK                   0x00008000
#define _PWMCAP6_PWMCAP12_LENGTH                 0x00000001

#define _LEBCON6_BPLL_POSITION                   0x00000000
#define _LEBCON6_BPLL_MASK                       0x00000001
#define _LEBCON6_BPLL_LENGTH                     0x00000001

#define _LEBCON6_BPLH_POSITION                   0x00000001
#define _LEBCON6_BPLH_MASK                       0x00000002
#define _LEBCON6_BPLH_LENGTH                     0x00000001

#define _LEBCON6_BPHL_POSITION                   0x00000002
#define _LEBCON6_BPHL_MASK                       0x00000004
#define _LEBCON6_BPHL_LENGTH                     0x00000001

#define _LEBCON6_BPHH_POSITION                   0x00000003
#define _LEBCON6_BPHH_MASK                       0x00000008
#define _LEBCON6_BPHH_LENGTH                     0x00000001

#define _LEBCON6_BCL_POSITION                    0x00000004
#define _LEBCON6_BCL_MASK                        0x00000010
#define _LEBCON6_BCL_LENGTH                      0x00000001

#define _LEBCON6_BCH_POSITION                    0x00000005
#define _LEBCON6_BCH_MASK                        0x00000020
#define _LEBCON6_BCH_LENGTH                      0x00000001

#define _LEBCON6_CLLEBEN_POSITION                0x0000000A
#define _LEBCON6_CLLEBEN_MASK                    0x00000400
#define _LEBCON6_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON6_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON6_FLTLEBEN_MASK                   0x00000800
#define _LEBCON6_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON6_PLF_POSITION                    0x0000000C
#define _LEBCON6_PLF_MASK                        0x00001000
#define _LEBCON6_PLF_LENGTH                      0x00000001

#define _LEBCON6_PLR_POSITION                    0x0000000D
#define _LEBCON6_PLR_MASK                        0x00002000
#define _LEBCON6_PLR_LENGTH                      0x00000001

#define _LEBCON6_PHF_POSITION                    0x0000000E
#define _LEBCON6_PHF_MASK                        0x00004000
#define _LEBCON6_PHF_LENGTH                      0x00000001

#define _LEBCON6_PHR_POSITION                    0x0000000F
#define _LEBCON6_PHR_MASK                        0x00008000
#define _LEBCON6_PHR_LENGTH                      0x00000001

#define _LEBDLY6_LEB_POSITION                    0x00000003
#define _LEBDLY6_LEB_MASK                        0x00000FF8
#define _LEBDLY6_LEB_LENGTH                      0x00000009

#define _LEBDLY6_LEB0_POSITION                   0x00000003
#define _LEBDLY6_LEB0_MASK                       0x00000008
#define _LEBDLY6_LEB0_LENGTH                     0x00000001

#define _LEBDLY6_LEB1_POSITION                   0x00000004
#define _LEBDLY6_LEB1_MASK                       0x00000010
#define _LEBDLY6_LEB1_LENGTH                     0x00000001

#define _LEBDLY6_LEB2_POSITION                   0x00000005
#define _LEBDLY6_LEB2_MASK                       0x00000020
#define _LEBDLY6_LEB2_LENGTH                     0x00000001

#define _LEBDLY6_LEB3_POSITION                   0x00000006
#define _LEBDLY6_LEB3_MASK                       0x00000040
#define _LEBDLY6_LEB3_LENGTH                     0x00000001

#define _LEBDLY6_LEB4_POSITION                   0x00000007
#define _LEBDLY6_LEB4_MASK                       0x00000080
#define _LEBDLY6_LEB4_LENGTH                     0x00000001

#define _LEBDLY6_LEB5_POSITION                   0x00000008
#define _LEBDLY6_LEB5_MASK                       0x00000100
#define _LEBDLY6_LEB5_LENGTH                     0x00000001

#define _LEBDLY6_LEB6_POSITION                   0x00000009
#define _LEBDLY6_LEB6_MASK                       0x00000200
#define _LEBDLY6_LEB6_LENGTH                     0x00000001

#define _LEBDLY6_LEB7_POSITION                   0x0000000A
#define _LEBDLY6_LEB7_MASK                       0x00000400
#define _LEBDLY6_LEB7_LENGTH                     0x00000001

#define _LEBDLY6_LEB8_POSITION                   0x0000000B
#define _LEBDLY6_LEB8_MASK                       0x00000800
#define _LEBDLY6_LEB8_LENGTH                     0x00000001

#define _AUXCON6_CHOPLEN_POSITION                0x00000000
#define _AUXCON6_CHOPLEN_MASK                    0x00000001
#define _AUXCON6_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPHEN_POSITION                0x00000001
#define _AUXCON6_CHOPHEN_MASK                    0x00000002
#define _AUXCON6_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON6_CHOPSEL_POSITION                0x00000002
#define _AUXCON6_CHOPSEL_MASK                    0x0000003C
#define _AUXCON6_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON6_BLANKSEL_POSITION               0x00000008
#define _AUXCON6_BLANKSEL_MASK                   0x00000F00
#define _AUXCON6_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON6_CHOPSEL0_POSITION               0x00000002
#define _AUXCON6_CHOPSEL0_MASK                   0x00000004
#define _AUXCON6_CHOPSEL0_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL1_POSITION               0x00000003
#define _AUXCON6_CHOPSEL1_MASK                   0x00000008
#define _AUXCON6_CHOPSEL1_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL2_POSITION               0x00000004
#define _AUXCON6_CHOPSEL2_MASK                   0x00000010
#define _AUXCON6_CHOPSEL2_LENGTH                 0x00000001

#define _AUXCON6_CHOPSEL3_POSITION               0x00000005
#define _AUXCON6_CHOPSEL3_MASK                   0x00000020
#define _AUXCON6_CHOPSEL3_LENGTH                 0x00000001

#define _AUXCON6_BLANKSEL0_POSITION              0x00000008
#define _AUXCON6_BLANKSEL0_MASK                  0x00000100
#define _AUXCON6_BLANKSEL0_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL1_POSITION              0x00000009
#define _AUXCON6_BLANKSEL1_MASK                  0x00000200
#define _AUXCON6_BLANKSEL1_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL2_POSITION              0x0000000A
#define _AUXCON6_BLANKSEL2_MASK                  0x00000400
#define _AUXCON6_BLANKSEL2_LENGTH                0x00000001

#define _AUXCON6_BLANKSEL3_POSITION              0x0000000B
#define _AUXCON6_BLANKSEL3_MASK                  0x00000800
#define _AUXCON6_BLANKSEL3_LENGTH                0x00000001

#define _PWMCON7_IUE_POSITION                    0x00000000
#define _PWMCON7_IUE_MASK                        0x00000001
#define _PWMCON7_IUE_LENGTH                      0x00000001

#define _PWMCON7_XPRES_POSITION                  0x00000001
#define _PWMCON7_XPRES_MASK                      0x00000002
#define _PWMCON7_XPRES_LENGTH                    0x00000001

