MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _PWMCON7_CAM_POSITION                    0x00000002
#define _PWMCON7_CAM_MASK                        0x00000004
#define _PWMCON7_CAM_LENGTH                      0x00000001

#define _PWMCON7_MTBS_POSITION                   0x00000003
#define _PWMCON7_MTBS_MASK                       0x00000008
#define _PWMCON7_MTBS_LENGTH                     0x00000001

#define _PWMCON7_DTCP_POSITION                   0x00000005
#define _PWMCON7_DTCP_MASK                       0x00000020
#define _PWMCON7_DTCP_LENGTH                     0x00000001

#define _PWMCON7_DTC_POSITION                    0x00000006
#define _PWMCON7_DTC_MASK                        0x000000C0
#define _PWMCON7_DTC_LENGTH                      0x00000002

#define _PWMCON7_MDCS_POSITION                   0x00000008
#define _PWMCON7_MDCS_MASK                       0x00000100
#define _PWMCON7_MDCS_LENGTH                     0x00000001

#define _PWMCON7_ITB_POSITION                    0x00000009
#define _PWMCON7_ITB_MASK                        0x00000200
#define _PWMCON7_ITB_LENGTH                      0x00000001

#define _PWMCON7_TRGIEN_POSITION                 0x0000000A
#define _PWMCON7_TRGIEN_MASK                     0x00000400
#define _PWMCON7_TRGIEN_LENGTH                   0x00000001

#define _PWMCON7_CLIEN_POSITION                  0x0000000B
#define _PWMCON7_CLIEN_MASK                      0x00000800
#define _PWMCON7_CLIEN_LENGTH                    0x00000001

#define _PWMCON7_FLTIEN_POSITION                 0x0000000C
#define _PWMCON7_FLTIEN_MASK                     0x00001000
#define _PWMCON7_FLTIEN_LENGTH                   0x00000001

#define _PWMCON7_TRGSTAT_POSITION                0x0000000D
#define _PWMCON7_TRGSTAT_MASK                    0x00002000
#define _PWMCON7_TRGSTAT_LENGTH                  0x00000001

#define _PWMCON7_CLSTAT_POSITION                 0x0000000E
#define _PWMCON7_CLSTAT_MASK                     0x00004000
#define _PWMCON7_CLSTAT_LENGTH                   0x00000001

#define _PWMCON7_FLTSTAT_POSITION                0x0000000F
#define _PWMCON7_FLTSTAT_MASK                    0x00008000
#define _PWMCON7_FLTSTAT_LENGTH                  0x00000001

#define _PWMCON7_DTC0_POSITION                   0x00000006
#define _PWMCON7_DTC0_MASK                       0x00000040
#define _PWMCON7_DTC0_LENGTH                     0x00000001

#define _PWMCON7_DTC1_POSITION                   0x00000007
#define _PWMCON7_DTC1_MASK                       0x00000080
#define _PWMCON7_DTC1_LENGTH                     0x00000001

#define _IOCON7_OSYNC_POSITION                   0x00000000
#define _IOCON7_OSYNC_MASK                       0x00000001
#define _IOCON7_OSYNC_LENGTH                     0x00000001

#define _IOCON7_SWAP_POSITION                    0x00000001
#define _IOCON7_SWAP_MASK                        0x00000002
#define _IOCON7_SWAP_LENGTH                      0x00000001

#define _IOCON7_CLDAT_POSITION                   0x00000002
#define _IOCON7_CLDAT_MASK                       0x0000000C
#define _IOCON7_CLDAT_LENGTH                     0x00000002

#define _IOCON7_FLTDAT_POSITION                  0x00000004
#define _IOCON7_FLTDAT_MASK                      0x00000030
#define _IOCON7_FLTDAT_LENGTH                    0x00000002

#define _IOCON7_OVRDAT_POSITION                  0x00000006
#define _IOCON7_OVRDAT_MASK                      0x000000C0
#define _IOCON7_OVRDAT_LENGTH                    0x00000002

#define _IOCON7_OVRENL_POSITION                  0x00000008
#define _IOCON7_OVRENL_MASK                      0x00000100
#define _IOCON7_OVRENL_LENGTH                    0x00000001

#define _IOCON7_OVRENH_POSITION                  0x00000009
#define _IOCON7_OVRENH_MASK                      0x00000200
#define _IOCON7_OVRENH_LENGTH                    0x00000001

#define _IOCON7_PMOD_POSITION                    0x0000000A
#define _IOCON7_PMOD_MASK                        0x00000C00
#define _IOCON7_PMOD_LENGTH                      0x00000002

#define _IOCON7_POLL_POSITION                    0x0000000C
#define _IOCON7_POLL_MASK                        0x00001000
#define _IOCON7_POLL_LENGTH                      0x00000001

#define _IOCON7_POLH_POSITION                    0x0000000D
#define _IOCON7_POLH_MASK                        0x00002000
#define _IOCON7_POLH_LENGTH                      0x00000001

#define _IOCON7_PENL_POSITION                    0x0000000E
#define _IOCON7_PENL_MASK                        0x00004000
#define _IOCON7_PENL_LENGTH                      0x00000001

#define _IOCON7_PENH_POSITION                    0x0000000F
#define _IOCON7_PENH_MASK                        0x00008000
#define _IOCON7_PENH_LENGTH                      0x00000001

#define _IOCON7_CLDAT0_POSITION                  0x00000002
#define _IOCON7_CLDAT0_MASK                      0x00000004
#define _IOCON7_CLDAT0_LENGTH                    0x00000001

#define _IOCON7_CLDAT1_POSITION                  0x00000003
#define _IOCON7_CLDAT1_MASK                      0x00000008
#define _IOCON7_CLDAT1_LENGTH                    0x00000001

#define _IOCON7_FLTDAT0_POSITION                 0x00000004
#define _IOCON7_FLTDAT0_MASK                     0x00000010
#define _IOCON7_FLTDAT0_LENGTH                   0x00000001

#define _IOCON7_FLTDAT1_POSITION                 0x00000005
#define _IOCON7_FLTDAT1_MASK                     0x00000020
#define _IOCON7_FLTDAT1_LENGTH                   0x00000001

#define _IOCON7_OVRDAT0_POSITION                 0x00000006
#define _IOCON7_OVRDAT0_MASK                     0x00000040
#define _IOCON7_OVRDAT0_LENGTH                   0x00000001

#define _IOCON7_OVRDAT1_POSITION                 0x00000007
#define _IOCON7_OVRDAT1_MASK                     0x00000080
#define _IOCON7_OVRDAT1_LENGTH                   0x00000001

#define _IOCON7_PMOD0_POSITION                   0x0000000A
#define _IOCON7_PMOD0_MASK                       0x00000400
#define _IOCON7_PMOD0_LENGTH                     0x00000001

#define _IOCON7_PMOD1_POSITION                   0x0000000B
#define _IOCON7_PMOD1_MASK                       0x00000800
#define _IOCON7_PMOD1_LENGTH                     0x00000001

