MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _LATH_LATH9_POSITION                     0x00000009
#define _LATH_LATH9_MASK                         0x00000200
#define _LATH_LATH9_LENGTH                       0x00000001

#define _LATH_LATH10_POSITION                    0x0000000A
#define _LATH_LATH10_MASK                        0x00000400
#define _LATH_LATH10_LENGTH                      0x00000001

#define _LATH_LATH11_POSITION                    0x0000000B
#define _LATH_LATH11_MASK                        0x00000800
#define _LATH_LATH11_LENGTH                      0x00000001

#define _LATH_LATH12_POSITION                    0x0000000C
#define _LATH_LATH12_MASK                        0x00001000
#define _LATH_LATH12_LENGTH                      0x00000001

#define _LATH_LATH13_POSITION                    0x0000000D
#define _LATH_LATH13_MASK                        0x00002000
#define _LATH_LATH13_LENGTH                      0x00000001

#define _LATH_LATH14_POSITION                    0x0000000E
#define _LATH_LATH14_MASK                        0x00004000
#define _LATH_LATH14_LENGTH                      0x00000001

#define _LATH_LATH15_POSITION                    0x0000000F
#define _LATH_LATH15_MASK                        0x00008000
#define _LATH_LATH15_LENGTH                      0x00000001

#define _ODCH_ODCH0_POSITION                     0x00000000
#define _ODCH_ODCH0_MASK                         0x00000001
#define _ODCH_ODCH0_LENGTH                       0x00000001

#define _ODCH_ODCH1_POSITION                     0x00000001
#define _ODCH_ODCH1_MASK                         0x00000002
#define _ODCH_ODCH1_LENGTH                       0x00000001

#define _ODCH_ODCH2_POSITION                     0x00000002
#define _ODCH_ODCH2_MASK                         0x00000004
#define _ODCH_ODCH2_LENGTH                       0x00000001

#define _ODCH_ODCH3_POSITION                     0x00000003
#define _ODCH_ODCH3_MASK                         0x00000008
#define _ODCH_ODCH3_LENGTH                       0x00000001

#define _ODCH_ODCH4_POSITION                     0x00000004
#define _ODCH_ODCH4_MASK                         0x00000010
#define _ODCH_ODCH4_LENGTH                       0x00000001

#define _ODCH_ODCH5_POSITION                     0x00000005
#define _ODCH_ODCH5_MASK                         0x00000020
#define _ODCH_ODCH5_LENGTH                       0x00000001

#define _ODCH_ODCH6_POSITION                     0x00000006
#define _ODCH_ODCH6_MASK                         0x00000040
#define _ODCH_ODCH6_LENGTH                       0x00000001

#define _ODCH_ODCH7_POSITION                     0x00000007
#define _ODCH_ODCH7_MASK                         0x00000080
#define _ODCH_ODCH7_LENGTH                       0x00000001

#define _ODCH_ODCH8_POSITION                     0x00000008
#define _ODCH_ODCH8_MASK                         0x00000100
#define _ODCH_ODCH8_LENGTH                       0x00000001

#define _ODCH_ODCH9_POSITION                     0x00000009
#define _ODCH_ODCH9_MASK                         0x00000200
#define _ODCH_ODCH9_LENGTH                       0x00000001

#define _ODCH_ODCH10_POSITION                    0x0000000A
#define _ODCH_ODCH10_MASK                        0x00000400
#define _ODCH_ODCH10_LENGTH                      0x00000001

#define _ODCH_ODCH11_POSITION                    0x0000000B
#define _ODCH_ODCH11_MASK                        0x00000800
#define _ODCH_ODCH11_LENGTH                      0x00000001

#define _ODCH_ODCH12_POSITION                    0x0000000C
#define _ODCH_ODCH12_MASK                        0x00001000
#define _ODCH_ODCH12_LENGTH                      0x00000001

#define _ODCH_ODCH13_POSITION                    0x0000000D
#define _ODCH_ODCH13_MASK                        0x00002000
#define _ODCH_ODCH13_LENGTH                      0x00000001

#define _ODCH_ODCH14_POSITION                    0x0000000E
#define _ODCH_ODCH14_MASK                        0x00004000
#define _ODCH_ODCH14_LENGTH                      0x00000001

#define _ODCH_ODCH15_POSITION                    0x0000000F
#define _ODCH_ODCH15_MASK                        0x00008000
#define _ODCH_ODCH15_LENGTH                      0x00000001

#define _CNENH_CNIEH0_POSITION                   0x00000000
#define _CNENH_CNIEH0_MASK                       0x00000001
#define _CNENH_CNIEH0_LENGTH                     0x00000001

#define _CNENH_CNIEH1_POSITION                   0x00000001
#define _CNENH_CNIEH1_MASK                       0x00000002
#define _CNENH_CNIEH1_LENGTH                     0x00000001

#define _CNENH_CNIEH2_POSITION                   0x00000002
#define _CNENH_CNIEH2_MASK                       0x00000004
#define _CNENH_CNIEH2_LENGTH                     0x00000001

#define _CNENH_CNIEH3_POSITION                   0x00000003
#define _CNENH_CNIEH3_MASK                       0x00000008
#define _CNENH_CNIEH3_LENGTH                     0x00000001

#define _CNENH_CNIEH4_POSITION                   0x00000004
#define _CNENH_CNIEH4_MASK                       0x00000010
#define _CNENH_CNIEH4_LENGTH                     0x00000001

#define _CNENH_CNIEH5_POSITION                   0x00000005
#define _CNENH_CNIEH5_MASK                       0x00000020
#define _CNENH_CNIEH5_LENGTH                     0x00000001

#define _CNENH_CNIEH6_POSITION                   0x00000006
#define _CNENH_CNIEH6_MASK                       0x00000040
#define _CNENH_CNIEH6_LENGTH                     0x00000001

#define _CNENH_CNIEH7_POSITION                   0x00000007
#define _CNENH_CNIEH7_MASK                       0x00000080
#define _CNENH_CNIEH7_LENGTH                     0x00000001

#define _CNENH_CNIEH8_POSITION                   0x00000008
#define _CNENH_CNIEH8_MASK                       0x00000100
#define _CNENH_CNIEH8_LENGTH                     0x00000001

#define _CNENH_CNIEH9_POSITION                   0x00000009
#define _CNENH_CNIEH9_MASK                       0x00000200
#define _CNENH_CNIEH9_LENGTH                     0x00000001

#define _CNENH_CNIEH10_POSITION                  0x0000000A
#define _CNENH_CNIEH10_MASK                      0x00000400
#define _CNENH_CNIEH10_LENGTH                    0x00000001

#define _CNENH_CNIEH11_POSITION                  0x0000000B
#define _CNENH_CNIEH11_MASK                      0x00000800
#define _CNENH_CNIEH11_LENGTH                    0x00000001

#define _CNENH_CNIEH12_POSITION                  0x0000000C
#define _CNENH_CNIEH12_MASK                      0x00001000
#define _CNENH_CNIEH12_LENGTH                    0x00000001

#define _CNENH_CNIEH13_POSITION                  0x0000000D
#define _CNENH_CNIEH13_MASK                      0x00002000
#define _CNENH_CNIEH13_LENGTH                    0x00000001

#define _CNENH_CNIEH14_POSITION                  0x0000000E
#define _CNENH_CNIEH14_MASK                      0x00004000
#define _CNENH_CNIEH14_LENGTH                    0x00000001

#define _CNENH_CNIEH15_POSITION                  0x0000000F
#define _CNENH_CNIEH15_MASK                      0x00008000
#define _CNENH_CNIEH15_LENGTH                    0x00000001

#define _CNPUH_CNPUH0_POSITION                   0x00000000
#define _CNPUH_CNPUH0_MASK                       0x00000001
#define _CNPUH_CNPUH0_LENGTH                     0x00000001

