MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU814/mcu.h
#define _TRISK_TRISK11_POSITION                  0x0000000B
#define _TRISK_TRISK11_MASK                      0x00000800
#define _TRISK_TRISK11_LENGTH                    0x00000001

#define _TRISK_TRISK12_POSITION                  0x0000000C
#define _TRISK_TRISK12_MASK                      0x00001000
#define _TRISK_TRISK12_LENGTH                    0x00000001

#define _TRISK_TRISK13_POSITION                  0x0000000D
#define _TRISK_TRISK13_MASK                      0x00002000
#define _TRISK_TRISK13_LENGTH                    0x00000001

#define _TRISK_TRISK14_POSITION                  0x0000000E
#define _TRISK_TRISK14_MASK                      0x00004000
#define _TRISK_TRISK14_LENGTH                    0x00000001

#define _TRISK_TRISK15_POSITION                  0x0000000F
#define _TRISK_TRISK15_MASK                      0x00008000
#define _TRISK_TRISK15_LENGTH                    0x00000001

#define _PORTK_RK0_POSITION                      0x00000000
#define _PORTK_RK0_MASK                          0x00000001
#define _PORTK_RK0_LENGTH                        0x00000001

#define _PORTK_RK1_POSITION                      0x00000001
#define _PORTK_RK1_MASK                          0x00000002
#define _PORTK_RK1_LENGTH                        0x00000001

#define _PORTK_RK11_POSITION                     0x0000000B
#define _PORTK_RK11_MASK                         0x00000800
#define _PORTK_RK11_LENGTH                       0x00000001

#define _PORTK_RK12_POSITION                     0x0000000C
#define _PORTK_RK12_MASK                         0x00001000
#define _PORTK_RK12_LENGTH                       0x00000001

#define _PORTK_RK13_POSITION                     0x0000000D
#define _PORTK_RK13_MASK                         0x00002000
#define _PORTK_RK13_LENGTH                       0x00000001

#define _PORTK_RK14_POSITION                     0x0000000E
#define _PORTK_RK14_MASK                         0x00004000
#define _PORTK_RK14_LENGTH                       0x00000001

#define _PORTK_RK15_POSITION                     0x0000000F
#define _PORTK_RK15_MASK                         0x00008000
#define _PORTK_RK15_LENGTH                       0x00000001

#define _LATK_LATK0_POSITION                     0x00000000
#define _LATK_LATK0_MASK                         0x00000001
#define _LATK_LATK0_LENGTH                       0x00000001

#define _LATK_LATK1_POSITION                     0x00000001
#define _LATK_LATK1_MASK                         0x00000002
#define _LATK_LATK1_LENGTH                       0x00000001

#define _LATK_LATK11_POSITION                    0x0000000B
#define _LATK_LATK11_MASK                        0x00000800
#define _LATK_LATK11_LENGTH                      0x00000001

#define _LATK_LATK12_POSITION                    0x0000000C
#define _LATK_LATK12_MASK                        0x00001000
#define _LATK_LATK12_LENGTH                      0x00000001

#define _LATK_LATK13_POSITION                    0x0000000D
#define _LATK_LATK13_MASK                        0x00002000
#define _LATK_LATK13_LENGTH                      0x00000001

#define _LATK_LATK14_POSITION                    0x0000000E
#define _LATK_LATK14_MASK                        0x00004000
#define _LATK_LATK14_LENGTH                      0x00000001

#define _LATK_LATK15_POSITION                    0x0000000F
#define _LATK_LATK15_MASK                        0x00008000
#define _LATK_LATK15_LENGTH                      0x00000001

#define _ODCK_ODCK0_POSITION                     0x00000000
#define _ODCK_ODCK0_MASK                         0x00000001
#define _ODCK_ODCK0_LENGTH                       0x00000001

#define _ODCK_ODCK1_POSITION                     0x00000001
#define _ODCK_ODCK1_MASK                         0x00000002
#define _ODCK_ODCK1_LENGTH                       0x00000001

#define _ODCK_ODCK11_POSITION                    0x0000000B
#define _ODCK_ODCK11_MASK                        0x00000800
#define _ODCK_ODCK11_LENGTH                      0x00000001

#define _ODCK_ODCK12_POSITION                    0x0000000C
#define _ODCK_ODCK12_MASK                        0x00001000
#define _ODCK_ODCK12_LENGTH                      0x00000001

#define _ODCK_ODCK13_POSITION                    0x0000000D
#define _ODCK_ODCK13_MASK                        0x00002000
#define _ODCK_ODCK13_LENGTH                      0x00000001

#define _ODCK_ODCK14_POSITION                    0x0000000E
#define _ODCK_ODCK14_MASK                        0x00004000
#define _ODCK_ODCK14_LENGTH                      0x00000001

#define _ODCK_ODCK15_POSITION                    0x0000000F
#define _ODCK_ODCK15_MASK                        0x00008000
#define _ODCK_ODCK15_LENGTH                      0x00000001

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK11_POSITION                  0x0000000B
#define _CNENK_CNIEK11_MASK                      0x00000800
#define _CNENK_CNIEK11_LENGTH                    0x00000001

#define _CNENK_CNIEK12_POSITION                  0x0000000C
#define _CNENK_CNIEK12_MASK                      0x00001000
#define _CNENK_CNIEK12_LENGTH                    0x00000001

#define _CNENK_CNIEK13_POSITION                  0x0000000D
#define _CNENK_CNIEK13_MASK                      0x00002000
#define _CNENK_CNIEK13_LENGTH                    0x00000001

#define _CNENK_CNIEK14_POSITION                  0x0000000E
#define _CNENK_CNIEK14_MASK                      0x00004000
#define _CNENK_CNIEK14_LENGTH                    0x00000001

#define _CNENK_CNIEK15_POSITION                  0x0000000F
#define _CNENK_CNIEK15_MASK                      0x00008000
#define _CNENK_CNIEK15_LENGTH                    0x00000001

#define _CNPUK_CNPUK0_POSITION                   0x00000000
#define _CNPUK_CNPUK0_MASK                       0x00000001
#define _CNPUK_CNPUK0_LENGTH                     0x00000001

#define _CNPUK_CNPUK1_POSITION                   0x00000001
#define _CNPUK_CNPUK1_MASK                       0x00000002
#define _CNPUK_CNPUK1_LENGTH                     0x00000001

#define _CNPUK_CNPUK11_POSITION                  0x0000000B
#define _CNPUK_CNPUK11_MASK                      0x00000800
#define _CNPUK_CNPUK11_LENGTH                    0x00000001

#define _CNPUK_CNPUK12_POSITION                  0x0000000C
#define _CNPUK_CNPUK12_MASK                      0x00001000
#define _CNPUK_CNPUK12_LENGTH                    0x00000001

#define _CNPUK_CNPUK13_POSITION                  0x0000000D
#define _CNPUK_CNPUK13_MASK                      0x00002000
#define _CNPUK_CNPUK13_LENGTH                    0x00000001

#define _CNPUK_CNPUK14_POSITION                  0x0000000E
#define _CNPUK_CNPUK14_MASK                      0x00004000
#define _CNPUK_CNPUK14_LENGTH                    0x00000001

#define _CNPUK_CNPUK15_POSITION                  0x0000000F
#define _CNPUK_CNPUK15_MASK                      0x00008000
#define _CNPUK_CNPUK15_LENGTH                    0x00000001

#define _CNPDK_CNPDK0_POSITION                   0x00000000
#define _CNPDK_CNPDK0_MASK                       0x00000001
#define _CNPDK_CNPDK0_LENGTH                     0x00000001

